{
  "calendar": {
    "b037bd18f22672a681a11f31d2309ba4f48e3941ff9ac63a6a164e72ee9dc5d0": [
      null,
      "task: search for calendar events or settings.",
      "task: change the calendar view",
      "task: manage calendar events and settings",
      "task: view or add events in the month of July",
      "task: create a new event in the calendar.",
      null
    ],
    "41fab8a8229a01a4c4c0872b6e5932eaf07f8213f9a950020253a3a4f0f484b3": [
      "Task: Change the calendar view to daily and access events.",
      "Task: Change the view of the calendar to weekly view and access events.",
      "Task: Switch to a different view in the calendar app, and specifically disable the monthly view.",
      "Task: Change the view of the calendar to yearly view and access events for the selected year.",
      "Task: Change the view in the calendar application to a simple event list.",
      null
    ],
    "e77ab12715745be71108b1340969dc8973018a73602438535093fc51ab6aab28": [
      null,
      "task: search for specific events or events within a specific time period in the calendar.",
      null,
      null,
      null,
      null,
      null
    ],
    "5a8d35cb1aa3694db466af3da76abf3d6fb93c837d671488805cab44910e9c38": [
      null,
      null,
      "Task: Adjust the display options for the calendar events to show a simple event list and then switch to a monthly view.",
      null,
      "Task: Change the view and display options for the calendar events.",
      null
    ],
    "a0580636289877f1e38e3d0fb2dc819e0bafcdaa9cfe463ed66522d8f283685a": [
      "task: change the calendar view to search for specific events or appointments.",
      null,
      null,
      null,
      null,
      "task: search for an event or appointment in the smartphone calendar app.",
      null
    ],
    "5534c66d5f37c0f29958ac89e66254fa62b5e261bf014a6fb71d9aa78a75d4b3": [
      "task: Add holidays to the calendar.",
      "Task: Add birthday events to the calendar for contacts.",
      "Task: Add contact anniversaries to the calendar.",
      "task: import events from an .ics file into the calendar.",
      "task: Export calendar events to an .ics file.",
      "task: Access and modify the settings and preferences of the calendar application.",
      "task: View information about the calendar app and access its settings and about section.",
      null
    ],
    "d153f77cd44709997f1a7e9d001e3e4724b767b98d985b994cdefd5ace2fc89b": [
      "Task: Add holidays of Algeria to the calendar or event.",
      "task: Add holidays from Argentina to the calendar.",
      "task: Add holidays for Australia in the calendar.",
      "Task: Adding holidays for Belgium to the calendar.",
      "Task: Add the holiday for Bolivia to the calendar or event.",
      "Task: Adding holidays from multiple countries to a calendar or event.",
      "Task: Adding holidays from multiple countries to the calendar.",
      "task: Adding holidays of multiple countries to the calendar",
      "Task: Add Colombian holidays to the calendar for managing and tracking events.",
      "Task: Adding holidays for Česká republika to the calendar.",
      "Task: Add holidays from Denmark to the calendar.",
      "Task: Adding holidays for multiple countries to the calendar.",
      "Task: Adding holidays from multiple countries to a calendar or event.",
      "Task: Add holidays from multiple countries to the calendar.",
      null,
      "Task: Adding holidays from multiple countries to the calendar",
      "Task: Add France to the list of selected countries for holidays in the calendar.",
      "task: Add holidays for the country of Hanguk to the calendar.",
      "Task: Adding holidays from multiple countries to the calendar.",
      "Task: Add holidays from the country Hrvatska (Croatia) to the calendar.",
      "Task: Add holidays from multiple countries to the user's calendar.",
      "Task: Adding holidays from multiple countries to the calendar.",
      "Task: Adding holidays from multiple countries to the calendar",
      "Task: Adding holidays from multiple countries to a calendar or event.",
      "task: Adding holidays from Latvia to the calendar",
      "Task: Add holidays for multiple countries to the calendar.",
      "Task: Adding Luxemburg holidays to the calendar.",
      "task: Adding holidays for multiple countries to a calendar or event.",
      "Task: Adding holidays for the country \"Magyarország\" to the calendar.",
      "Task: Adding Mexican holidays to the calendar.",
      "Task: Adding holidays from multiple countries to the calendar.",
      "Task: Adding holidays from Japan to the calendar.",
      "Task: Adding holidays from the country \"Norge\" to the calendar.",
      "Task: Adding holidays from multiple countries (including Austria) to the calendar.",
      "task: Add holidays from multiple countries to the calendar.",
      "Task: Adding holidays from multiple countries to the calendar.",
      "task: adding holidays for multiple countries in the calendar.",
      "Task: Adding holidays for multiple countries to the calendar.",
      "Task: Adding holidays for multiple countries to the calendar.",
      "Task: Adding holidays from Switzerland to the calendar.",
      "Task: Add holidays for the country \"Srbija\" to the calendar.",
      "task: Add holidays from Slovenia to the calendar.",
      "Task: Adding holidays for the country \"Slovensko\" to the calendar.",
      "Task: Adding holidays from South Africa to the calendar.",
      "Task: Add holidays for the country \"Suomi\" to the calendar.",
      "task: add holidays from Sweden to the calendar.",
      "Task: Add holidays of Ukraine to the calendar.",
      "Task: Adding United Kingdom holidays to the calendar.",
      "task: Adding holidays for the United States to the calendar."
    ],
    "0dfcd2ff9939bb98a09aca5707c630569835c9f6d66e24ea1e2d8dc53229c7a6": [
      null,
      "task: sync and add contact birthdays to the user's calendar.",
      "task: add contact birthdays to the calendar, but deny calendar permissions for accessing contacts.",
      null
    ],
    "ee9f0855b6686a9d0bd515c215315d215fa6d3438addbaf227d25e19eaa3185a": [
      null,
      "task: Import events from an .ics file into the user's calendar.",
      "task: Import events from an .ics file to the calendar.",
      null
    ],
    "4927876f7234d01f13659cbd78612b2d37be153f11f451ff6ed0a731a0aff240": [
      null,
      "task: Importing events from an .ics file and viewing file details.",
      "task: Import events from an .ics file and set alarms for them.",
      "task: Import events from an .ics file from the Android directory.",
      "task: Import audiobooks from an external file to the calendar app.",
      "task: import events from an .ics file to the calendar.",
      "task: Import events from an .ics file into the calendar.",
      "task: Import events from an .ics file into the calendar.",
      "Task: Import events from an .ics file and view the list of movies with 0 items.",
      "task: Import music from an .ics file and allow access to view events.",
      "task: Import events from an .ics file and enable notifications for those events.",
      "task: Import events from an .ics file and view pictures",
      "task: import events from an .ics file and view podcasts with 0 items.",
      "task: Import events from an .ics file and then cancel the importing process.",
      null,
      "task: import .ics file and set a custom ringtone.",
      "Task: Import events from an .ics file and view the details of the selected file.",
      "task: Import events from an .ics file into the calendar."
    ],
    "0fbb9314ecc2dc97537efa196c898becd9cc76bd2bde96ea0f569c03fc7be33d": [
      null,
      null,
      "task: Import events from an .ics file and set alarms for the imported events.",
      null,
      null
    ],
    "88f29884fb5eacc4d8ce762764b2b603ed48812c458991e3abd38bffb6201dff": [
      null,
      "task: Export calendar events to an .ics file and save it in the internal storage folder.",
      "task: Export calendar events to an .ics file and manage the alarms related to those events.",
      "task: Export calendar events as an .ics file on an Android device.",
      "task: Export audiobooks to an .ics file and organize them into folders in the smartphone's storage.",
      "task: Export calendar events to an .ics file and save it in the DCIM folder.",
      "task: Export calendar events to an .ics file and save it in the Documents folder.",
      "task: Export calendar events to an .ics file and download it to the smartphone's storage.",
      "Task: Export calendar events to an .ics file and view available movies in the calendar.",
      "Task: Export calendar events to an .ics file and transfer them to a specific folder in the smartphone's storage.",
      "task: Export the calendar events to an .ics file and manage notifications.",
      "task: Export calendar events to an .ics file and manage pictures in the selected folder.",
      "Task: Export calendar events to an .ics file and manage files and folders in the smartphone's storage.",
      "task: Export calendar events to an .ics file and cancel the operation.",
      "task: export calendar events as an .ics file.",
      null,
      "task: Export calendar events to an .ics file and manage the folder or files in the smartphone's storage related to ringtones.",
      "Task: Export calendar events to an .ics file and save it in a specific folder in the smartphone's storage.",
      "Task: Export calendar events to an .ics file and save it in a specific folder on the smartphone's storage."
    ],
    "44320aacba99d74a471c8ea105cb386326fa93cf80b9334a4b9ae86181eebfbd": [
      null,
      null,
      "task: export calendar events to an .ics file and manage alarms in the smartphone calendar app.",
      null,
      null,
      null
    ],
    "6c4d5e9b3856a2505fed43c416dca9ffb02b886db89fcb0c3bfd1fab26ee24eb": [
      null,
      null,
      "task: Clear the search query in the calendar to start a new search.",
      null,
      null,
      null,
      "task: search for a particular event in the calendar.",
      null
    ],
    "e5bb0f7b3eb647b48936f7e4e35769d570c6ae713970b911aa4297f24275ca7f": [
      "Task: Customize calendar settings, event reminders, CalDAV sync, weekly/monthly view settings, and widget customization.",
      null,
      "task: customize the colors of the calendar",
      "Task: Customize and manage event types in the calendar.",
      "task: change the time format to 24-hour format on the calendar.",
      "task: Change the start day of the week on the calendar from Sunday to a different day.",
      "Task: Customize calendar settings to turn off the \"Avoid showing What's New on startup\" feature.",
      "task: delete all events in the calendar.",
      null,
      "task: Turning off vibrate for reminder notifications in calendar settings.",
      "Task: Customize the reminder sound for events on the calendar.",
      "Task: Change the snooze time for event reminders in the calendar settings.",
      "task: customize the snooze time for event reminders in the calendar app.",
      null,
      null,
      "task: Turn off CalDAV sync for the calendar.",
      null,
      "task: change the start time of the day in the calendar to 07:00.",
      "task: customize the calendar settings to end the day at 23:00.",
      null,
      "task: customize the calendar settings to turn off week numbers display.",
      "Task: Customize the calendar settings to turn off the grid display.",
      null,
      "Task: Customize calendar event settings to disable the replacement of event descriptions with locations.",
      "task: Customize calendar settings to display events from the past as never shown.",
      null,
      "Task: Customize the font size settings for the calendar app."
    ],
    "a39f4e7423a7ec05e4957e3d2f62cdb8ac8603374c98ce2944ecd1ebe401a96c": [
      null,
      null,
      "Task: Change the theme color of the calendar app to dark mode.",
      "Task: Change the text color for the calendar app's theme and apply it to all Simple Apps.",
      "task: Change the background color of the calendar app.",
      "Task: Customize the primary color of the calendar app's theme.",
      "Task: Customize the theme colors of the calendar app and apply them to all Simple Apps.",
      null
    ],
    "b555610691d75afd1c4cb87308b58d4f99273beea38325be444d78c94e28d986": [
      null,
      "task: customize the colors for all Simple Apps in the calendar.",
      "task: customize the colors of the calendar app and apply them to all Simple Apps.",
      null
    ],
    "aa57b74d867f195506afa45cddabf5199e67a99c324d7b1737200c1a9ec959e5": [
      "Task: Customize the color theme of the calendar to Dark and uncheck the Light option.",
      "Task: Customize the calendar theme to Dark and navigate back to the previous screen.",
      "task: customize the colors and theme of the calendar and save the changes.",
      "task: Change calendar theme to dark and customize colors, specifically making the theme black and white.",
      "task: customize the colors and theme of the calendar interface.",
      null
    ],
    "1f858da570d72fc2746e7cd21ac2951b72173dc7602f9d9e106fff093ce451d1": [
      null,
      null,
      "Task: Customize calendar theme to Dark and save the changes.",
      "task: customize the color theme to Dark and Light in the calendar app.",
      null,
      null,
      null,
      null,
      null
    ],
    "6d9c92d565fb64f096c91972078aff8091e9454266126dceb64773451254deb7": [
      null,
      null,
      "Task: Create a new event type in the calendar.",
      "task: add or edit holiday events in the calendar.",
      "task: create a new regular event type in the calendar.",
      null
    ],
    "5e6d92c26cdd25bb7b5aaa78ee87746384f33a49cfdd9f7ce93810c348652f34": [
      null,
      null,
      null,
      "task: Add a new event type with specific title, color, and confirmation buttons in the calendar app.",
      "task: create a new event type in the calendar app with a specific title, color, and confirmation button.",
      null
    ],
    "e76daded6e1b908aa09b51fe2d2bc59c51805cfd8410d347e5948abcf409f865": [
      null,
      null,
      null,
      null,
      "task: edit or cancel a regular event in the calendar.",
      "task: create a new regular event in the calendar",
      null
    ],
    "26c75e39ef6829993b7623d3fba5f203bfb6b9bb5372a6cb912330f3b11d6693": [
      null,
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "b030be607a7b965b12afa6b526f698a0c2a454938b56bb9753a0eed6516a4aa6": [
      null,
      "task: delete all events from the user's calendar.",
      "task: delete all events from the calendar.",
      null
    ],
    "1d37b5a0628f5da09a91909ab5aa8fb175ef4f5e000c8e7b2baa06df4938b113": [
      null,
      "Task: Customize the calendar reminder sound by adding a new sound option.",
      null,
      "Task: Change the default reminder sound for calendar events and notifications to \"No sound\".",
      "Task: Change the reminder sound for calendar events and notifications to a custom sound.",
      "Task: Change the reminder sound for calendar events and notifications to \"Adara\".",
      "Task: Change the reminder sound for calendar events and notifications to Aldebaran.",
      "task: Change the reminder sound for calendar events and notifications to \"Altair\".",
      "task: Set a reminder sound for calendar events and notifications and select the recipient Alya to receive notifications.",
      "Task: Set a different reminder sound (Antares) for calendar events and notifications.",
      "task: change the reminder sound for calendar events and notifications to \"Antimony\".",
      "task: Change the reminder sound for calendar events and notifications to \"Arcturus\".",
      "Task: Change the default reminder sound for calendar events and notifications to \"Argon\".",
      "Task: Change the reminder sound for calendar events and notifications on the smartphone.",
      "Task: Set a custom reminder sound for calendar events and notifications in the settings.",
      null,
      "Task: Change the default reminder sound for calendar events and notifications to \"Beat Box Android\".",
      "Task: Change the reminder sound for calendar events and notifications to \"Bellatrix\" from the default \"Pixie Dust\".",
      "Task: Change the reminder sound for calendar events and notifications to \"Beryllium\".",
      "Task: Set a custom reminder sound for calendar events and notifications.",
      "Task: Customize the sound settings for calendar events and notifications.",
      "task: change the reminder sound for calendar events and notifications in the settings.",
      "Task: Change the reminder sound for calendar events and notifications to \"Capella\".",
      "task: Change the default reminder sound for calendar events and notifications to \"Captain's Log\".",
      "task: Change the default reminder sound for calendar events and notifications to \"Castor\".",
      "task: change the reminder sound for calendar events and notifications.",
      "task: Change the default reminder sound for calendar events and notifications to Cobalt.",
      "Task: Set a reminder sound for calendar events and notifications to \"Cricket\".",
      "Task: Change the reminder sound for calendar events and notifications from the default (Pixie Dust) to \"Dear Deer\".",
      "Task: Set a specific sound (Deneb) for calendar events and notifications on the smartphone.",
      "Task: Customize the reminder sound for calendar events and notifications to a different option (possibly \"Doink\").",
      "task: Change the reminder sound for calendar events and notifications to \"Don't Panic\"",
      "Task: Change the default reminder sound for calendar events and notifications to \"Drip\".",
      "Task: Change the reminder sound for calendar events and notifications to \"Electra\".",
      "Task: Change the reminder sound for calendar events and notifications to \"Fluorine\".",
      "Task: Customize reminder sound for calendar events and notifications to the sound \"Fomalhaut\".",
      "Task: Customize the reminder sound for calendar events and notifications.",
      "task: Change the reminder sound for calendar events and notifications to \"Heaven\".",
      "task: Change the default reminder sound for calendar events and notifications to \"Helium\".",
      "Task: Change the reminder sound for calendar events and notifications to \"Highwire\" or select a different sound.",
      "Task: Change the default reminder sound for calendar events and notifications to \"Hojus\".",
      "Task: Change the reminder sound for calendar events and notifications to \"Iridium\".",
      "Task: Change the reminder sound for calendar events and notifications to \"Krypton\" instead of the default \"Pixie Dust\".",
      "task: change the reminder sound for calendar events and notifications to Kzurb Sonar.",
      "task: Set a custom reminder sound for calendar events and notifications using the \"Lalande\" sound.",
      "Task: Change the reminder sound for calendar events and notifications to \"Look At Me\".",
      "Task: Set the reminder sound for calendar events and notifications to \"Merope\".",
      "Task: Customize reminder sound for calendar events and notifications by setting it to \"Mira\" instead of the default \"Pixie Dust\".",
      "Task: Customize the reminder sound for calendar events and notifications in the settings.",
      "Task: Set Moonbeam as the reminder sound for calendar events and notifications.",
      "Task: Change the reminder sound for calendar events and notifications to \"On The Hunt\".",
      "task: change the reminder sound for calendar events and notifications to \"Palladium\".",
      "Task: Change the reminder sound for calendar events and notifications to \"Pixie Dust\".",
      "Task: Change the reminder sound for calendar events and notifications to \"Pizzicato\".",
      "task: change the reminder sound for calendar events and notifications.",
      "Task: Change the reminder sound for calendar events and notifications to \"Polaris\" from the default sound \"Pixie Dust\".",
      "Task: Change the default reminder sound for calendar events and notifications to \"Pollux\".",
      "Task: Change the reminder sound for calendar events and notifications to \"Procyon\".",
      "task: change the reminder sound for calendar events to Proxima.",
      "task: change the reminder sound for calendar events and notifications to \"Radon\".",
      "Task: Change the default sound for calendar reminders to \"Regulus\".",
      "task: change the reminder sound for calendar events and notifications to Rubidium.",
      "Task: Change the reminder sound for calendar events and notifications to \"Selenium\" instead of the default sound \"Pixie Dust\".",
      "Task: Change the reminder sound for calendar events and notifications to \"Shaula\" on the smartphone app.",
      "task: change the reminder sound for calendar events and notifications to \"Sirius\"",
      "Task: Change the reminder sound for calendar events and notifications to 'Sirrah'",
      "task: change the reminder sound for calendar events and notifications to \"Space Seed\".",
      "Task: Change the default reminder sound for calendar events and notifications to \"Spica\".",
      "task: change the reminder sound for calendar events and notifications to \"Strontium\".",
      "Task: Change the reminder sound for calendar events and notifications to \"Syrma\"."
    ],
    "2563cd0132df7babcf5f9118008656bfd16c87e3d799ad0d679adbe9d56e76d1": [
      "task: adjust snooze time for calendar reminders to 10 minutes with an option to check a 1-minute reminder as well.",
      "task: set a snooze duration for calendar reminders of 10 minutes",
      "task: change the snooze time for reminders to 10 minutes and disable the option for pre-set 10-minute snooze time.",
      "task: Set a reminder with a snooze time of 10 minutes and check a 30-minute option.",
      "task: Set a reminder with a snooze time of 10 minutes and a default duration of 1 hour.",
      "task: adjust the snooze time for reminders to 10 minutes with a custom duration option.",
      "task: Adjust the snooze time for event reminders, specifically setting it to a duration of 10 minutes.",
      null
    ],
    "43ff20b2170ac83f282914166cb4a238dc44227ee2e1538042496fe067962d47": [
      "Task: Adjust calendar settings to display events from the past without showing the duration in minutes.",
      "task: adjust the settings to display events from the past never and check the option to display the duration of calendar events in hours.",
      "task: adjust the settings to display past events on the calendar and confirm the duration of a calendar event.",
      "task: change the settings to display events from the past never",
      "task: Adjust the settings to display events from the past as \"Never\" in the calendar app.",
      null
    ],
    "37d74d294f771243b96af3e6e82d1a7b7295b06891f76c69b80a96ed5d4f1930": [
      "Task: Adjust the font size for calendar events to medium and enable the small font option.",
      "task: Adjust the font size for calendar events to medium.",
      "task: change the font size of the calendar events to large.",
      null
    ],
    "77dfea11565b42a31fee51cb52720d35ec189b30db4c597fd2ea88af5f833b2e": [
      "Task: Create a new event in the calendar with reminders and repetition options.",
      null,
      "task: create a new event in the calendar with reminders and repetition options",
      null,
      null,
      null,
      "Task: Create a new event in the calendar with a specific time and date, and without an all-day status.",
      "Task: Create a new event on July 1 with reminders and repetition options.",
      "task: create a new event in the calendar at 12:00 PM",
      "task: create a new event on July 1st with reminders and repetition options",
      "task: create a new event in the calendar for 12:00 PM.",
      "Task: Create a new event in the calendar with a reminder set 10 minutes before.",
      "Task: Create a new event in the calendar with multiple reminders and options for repetition.",
      "Task: Create a new event in the calendar with no repetition and set reminders.",
      "Task: Create a new regular event in the calendar with reminders and repetition options.",
      null
    ],
    "1de405d94a0dc161d25004ddbf768abf707e415a63851c67ba42d90234788c52": [
      "Task: Create a new event on July 1, 2023 in the calendar app.",
      "task: create a new event on July 1st.",
      "Task: Create a new event on July 1, 2023 in the calendar app.",
      "Task: Create a new event on July 2, 2023 in the calendar.",
      "Task: Create a new event on July 3, 2023 in the calendar app interface.",
      "task: Add a new event and set it for July 4, 2023.",
      "Task: Create a new event on July 5, 2023 in the calendar app.",
      "Task: Create a new event on July 6, 2023, in the calendar app.",
      "Task: Create a new event on July 7, 2023 in the calendar app.",
      "task: create a new event on July 8, 2023",
      "Task: Create a new event on July 9, 2023 in the calendar app.",
      "Task: Create a new event on July 10, 2023 in the calendar.",
      "Task: Create a new event on July 11, 2023 in the calendar app.",
      "Task: Create a new event on July 12, 2023 in the calendar app.",
      "Task: Create a new event on July 13, 2023 in the calendar app.",
      "task: create a new event on July 14, 2023 in the calendar app.",
      "Task: Create a new event on July 15, 2023 in the calendar app.",
      "task: create a new event on July 16, 2023.",
      "task: create a new event on July 17, 2023, in the calendar.",
      "task: Create a new event on July 18, 2023 in the calendar app.",
      "Task: Create a new event on July 19, 2023 in the calendar app.",
      "task: create a new event on July 20, 2023 in the calendar.",
      "Task: Schedule a new event on July 21, 2023 in the calendar app.",
      "task: create a new event on July 22, 2023 in the calendar app.",
      "Task: Create a new event on July 23, 2023 in the calendar app interface.",
      "task: Create a new event on July 24, 2023 in the calendar app.",
      "task: create a new event on July 25, 2023 in the calendar app.",
      "Task: Create a new event on July 26, 2023 in the calendar app.",
      "Task: Create a new event on July 27, 2023 in the calendar app.",
      "Task: Create a new event on July 28, 2023 in the calendar app.",
      "Task: Create a new event on July 29, 2023 in the calendar app.",
      "Task: Create a new event on July 30, 2023 in the calendar app.",
      "task: create a new event on July 31, 2023 in the calendar app.",
      "Task: Create a new event on July 1st and navigate to the previous month in the calendar app interface.",
      "Task: Create a new event on July 1st and navigate to the calendar for the next month.",
      "Task: Create a new event on July 1 (Saturday) in the calendar app.",
      "task: create a new event on July 1",
      null
    ],
    "05f8de41ce1b0c123111ea9222baa9416ddd440d57599ff16b55009df43ffc0e": [
      "task: create a new event on the calendar for 12:00 PM on the 12th day.",
      null,
      "task: create a new event in the calendar app at 12:00 PM on the current day.",
      "task: schedule a new event for 12:00 PM in the calendar app.",
      "task: create a new event in the calendar app at 12:00 PM.",
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      "Task: Create a new event in the calendar app and set the time to 12:00 PM",
      "task: create a new event on the calendar and set the time for the event to be at 12:00 PM",
      "task: create a new event in the calendar app at 12:00 PM.",
      null
    ],
    "7be671f67b12a11b3a667b6780e9e80104be5d122c8a534c1584af702c2fd5f7": [
      "Task: Set a reminder for a new calendar event that triggers 10 minutes before with no reminder message.",
      "task: Set a new calendar event with a reminder that goes off 10 minutes before the event starts.",
      "Task: Set a reminder for a new calendar event with a customizable timing option of 10 minutes before the event.",
      "task: create a new calendar event with a reminder set for 10 minutes before, and an optional reminder for 5 minutes before.",
      "Task: Set a reminder for a new calendar event, with the reminder set to 10 minutes before the event.",
      "Task: Set a reminder for a new calendar event with a customizable timing option to receive a notification 10 minutes before the event.",
      "task: Set a reminder for a new calendar event with customizable timing options.",
      "Task: Set a reminder for a new calendar event with a custom timing option, 10 minutes before.",
      null
    ],
    "67d7de90b58f15bd10b1849244985f177aca5e5185efb840cdf4abb0929d3b22": [
      "task: create a new calendar event and set it to not repeat.",
      "task: Create a new daily event on the calendar without repetition.",
      "task: create a new weekly event with no repetition",
      "Task: Create a new monthly event without repetition in the calendar.",
      "task: create a new yearly event on the calendar.",
      "task: create a new calendar event with custom repetition options.",
      null
    ],
    "08c085a404864d3a0aba71a1700a518fde0caa977a5caaca413b3e1a650f4f17": [
      "task: create a new regular event in the calendar while excluding holidays.",
      "task: create a new regular event and uncheck the default regular event option.",
      "task: create a new regular event and add a new event type.",
      null
    ],
    "6d7a2042bf7d436d87f1070d8cda34b6188388bcc1a16b399a21429cbb8ca598": [
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null
    ],
    "fc730a8bba08c33a902a3a4119cea4ff4808d5d2449e228761d5a2ef73867d5c": [
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null
    ]
  }
}