{"voicerecorder": {"ebc3c7ccc0dfade1d397a93599b9919dc50a79323f6b8302b99aff76932e937f": [null, "task: adjust voice recording settings", "task: Access information and settings related to voice recording, and potentially record or play audio.", null, null, "Task: Play a recorded audio file on the voice recorder app.", null], "4a49c9cd6a208c6e931246695e44bd78a97eeb47c5a7f11a226d98a6a18bbd98": [null, null, "task: customize the colors and settings of the voice recorder app.", "task: customize widget colors", null, "Task: Customize the date and time format in the voice recorder app.", "task: customize settings for the voicerecorder app, specifically hiding the recording notification.", "task: adjust the settings to enable automatic recording when launching the voice recorder app.", "task: Change the save location for voice recordings to Internal/Music/Recordings.", "task: Customize audio settings in the Voicerecorder app.", "task: customize audio settings for the voice recorder app.", "task: change the bitrate of the voice recording.", null, "task: adjust the audio bitrate for voice recording."], "06d12a81a984d165f6107d52300085d901815170a2c6546fc7129a5ff30b88da": [null, "task: customize the colors and theme of the voicerecorder app to a dark theme.", "task: change the text color for the voicerecorder app.", "task: change the background color of the voicerecorder app.", "task: change the primary color of the voicerecorder app.", "Task: Change the app icon color in the voicerecorder app's settings menu.", null], "db8da4c4aed69c1ee76c3c58386edc9a9b8924ab9d096893dc87ae36659c73bb": [null, "Task: Customize the colors and theme of the voicerecorder app to a dark theme.", null], "ee4bc85165d8e30eb0e6662bbd800d46bbbc7663b2262c79288c29040a6fb67d": ["task: customize the app interface display settings to use the dark theme and disable auto light/dark mode.", "task: customize the voice recorder app's interface theme to a dark color.", "task: Change the theme of the voicerecorder app from dark to light.", "task: customize the theme of the voicerecorder app to use a dark red color scheme.", "task: Change the app interface to the dark theme.", "Task: Customize the theme of the voicerecorder app to Dark mode and enable the \"Black & White\" display option.", "task: Customize the colors/theme of the voicerecorder app interface to a dark theme.", null], "e4bc83f77703f52d07cd5f9ca5fb500d16741aefd16d4f6f35002bd13525c940": ["task: change the date and time format in the settings of the voicerecorder app.", "task: Change the date and time format settings on the voicerecorder app to 16/02/2021 format.", "task: Change the date and time format in the voice recorder app.", "task: Change the date and time format to display as \"16-02-2021\" on the voicerecorder app.", "task: Change the date and time format on the voicerecorder app to display as 02-16-2021.", "task: Change the date and time format on the Voice Recorder app to display as \"2021-02-16\".", "task: change the date and time format on the voicerecorder app", "task: change the date and time format in the voicerecorder app.", "task: Change the date and time format to 24-hour format in the voicerecorder app.", "task: change the date and time format in the voicerecorder app.", "task: change the date and time format in the voicerecorder app settings.", null], "ee299cea28a932fda0ab93f6c90cf8f780430011b03f9faf73b7cfc4cdf494fe": [null, null, null, null, null, null, "task: Customize the settings to hide the recording notification in the voicerecorder app.", null, null, null, null, null, null, null], "c0b0baa7678fd8322ba820a18a1ab1ba2901fcfc7d0440fc830b6307491d046f": [null, "task: Change the default location for saving audio recordings in the VoiceRecorder app.", "task: Change the default folder location for saving audio recordings to the Music folder in the Internal storage.", "Task: Change the settings to save the recorded audio files in the \"Internal/Music/Recordings\" folder.", "task: Change the save location of voice recordings to the \"Internal/Music/Recordings\" folder in Settings and access the recording file named test1.m4a.", "task: Change the folder where recordings are saved in the voicerecorder app to Internal/Music/Recordings and select the audio file \"test2.m4a\" to perform an action on it.", "task: Change the folder location where the voice recordings are saved to Internal/Music/Recordings.", "task: change the save location for audio recordings", null], "6919cfa097bb6dc5bcc70b3a04c75500aeb04e8db499b49ba0c033318894e3aa": [null, "task: change the storage location for voice recordings to External/Music/Recordings.", "task: change storage location for voice recordings to internal storage.", null], "f4e3bb56b18f61edcbc485302f7614a0c5ba2e590c7ce1e15e06c3272314ca1e": [null, "task: Selecting the location for saving audio recordings and choosing to save them either internally or on an SD card.", "task: Change the settings to save voice recordings in the internal storage and select a folder for audio files.", "task: change the save location for voice recordings to the internal storage and enable the use of an SD card.", "task: Change the default folder for saving recorded audio files to Internal storage and check if an audiobook is available.", "task: change the default storage location for voice recordings to the internal storage instead of the SD card.", "task: Set the save location for audio recordings to the internal storage and check the availability of an SD card.", "task: Set the folder location to Internal storage for saving audio recordings and check for any pending downloads.", "task: Change the default storage location for voice recordings to the internal storage and enable the storage option for SD card.", "task: Change the directory for saving audio recordings to the Internal storage and check if the SD card is available.", "task: Change the destination folder for recording audio files to \"Internal/Music/Recordings\" and check if the SD card is selected.", "task: change the default folder for saving audio recordings and manage notifications.", null, null, null, "task: Change the default storage location for voice recordings to be saved in the internal storage instead of the SD card.", "task: Change the default folder for saving audio recordings and manage file options for the voicerecorder app.", "task: Change the storage location for audio recordings and manage file options related to the voicerecorder app.", null], "91794cabe9baed2051b13acffe4b46f802ee09d1f65e86fa1b717b46bac5b418": [null, null, "task: Change the folder where recordings are saved to \"Internal/Music/Recordings\"", null, null, null], "95beae32f88ba63e6f6e4cd7eaf4a4e3ae5ba656437bfadff97612b12d90732e": ["Task: Change the audio recording format from m4a to either mp3 or ogg.", "Task: Change audio recording format to mp3.", "Task: Change audio recording format to \"ogg (Opus)\" in the voicerecorder app settings.", null], "5abd380a0c963678d243621338a4b57c51aa452f7503f101867b33b7eb2e323e": ["task: Disable camera as audio input source for voice recording.", "Task: Adjust the audio source settings for voice recording on the smartphone.", "task: configure audio input sources for voice recording on the smartphone.", "task: Enable voice recognition as an audio source for voice recording on the smartphone.", "task: Set up audio input source for voice recording on the smartphone.", "task: change the audio source for voice recording to camera and enable the unprocessed audio option.", "task: configure audio input sources for voice recording on voicerecorder app.", null], "d95438ce61e20b6f15338518b419c703ebd4fbe52def4f815c0dfd3c43ce5357": ["Task: Select the audio recording quality as 32 kbps and go back to the previous screen.", "task: change the audio recording quality to 64 kbps and navigate back to the previous screen.", "task: Change the audio recording quality to 96 kbps in the voicerecorder app settings.", "task: change the audio recording quality settings in the voicerecorder app and navigate back to the previous screen.", "task: change audio recording quality to 160 kbps and navigate back to previous screen.", "Task: Change the audio recording quality from 128 kbps to 192 kbps in the VoiceRecorder app settings.", "task: change the audio recording bitrate to 256 kbps in the voicerecorder app.", "task: change audio recording quality to 320 kbps in the voicerecorder app settings.", null], "01761c55c458560c451ae5ab946cb58da6702f4ce6f72f6221b0d3ce78e138be": [null, null, "task: Access frequently asked questions to find answers or solutions to common issues or inquiries related to the app.", "task: Contact the app developer for support or inquiries.", null, "task: View information about the app's contributors and their involvement in the project.", "task: Donate to support the development of the voicerecorder app.", null, "task: Access the Facebook page or link for the voice recorder app.", "task: Accessing the GitHub page of the VoiceRecorder app.", "task: Access the Reddit section of the voicerecorder app.", "task: Access information about the app, particularly related to the messaging platform Telegram.", null, null, "task: Access the website for voicerecorder app to find more information about it.", "task: access the privacy policy of the voicerecorder app.", "task: view information about the app's third-party licenses", "task: view information and details about the voicerecorder app", null], "41f3305e06df4df3ac8ee3f17ad17a40a34230880a4a372f4cdaa288d55541b8": [null, null, null, "task: playback the voice recording \"test1.m4a\" from the file information.", "task: play the voice recording \"test2.m4a\" that was created on 30.06.2023 at 12:26 PM.", "task: Play a voice recording from the beginning.", "task: navigate to the previous voice recording in the player interface.", "task: Play a voice recording.", "task: play the next voice recording in the playlist.", "task: Play a voice recording.", null, null], "04d9f6047cbe57fd18cd55bf2aafc94dd0c67c26c4380ca5cade1c4cb57397a3": [null, null, null, null, null, null, "task: Play the voice recording \"test1.m4a\" at the 10-second mark.", null, null, null, null, null, null]}, "messenger": {"fc3f74bf7d6eb2bf6fa69fef7f791f434acac4448c9f2aac78a0820fd4b348f9": [null, "Task: Update notification settings for Messenger.", "Task: View information about the Messenger app, such as its settings and management options.", "task: search for a specific message thread or conversation", "task: Send a message to Bob and include the text \"Hey 30.06\".", "task: Send a message to Alice saying \"Hello\" on June 30th.", null], "bad64af50b28261e6fc5ca0ed80019492fe49097d36edc5faa2a2742789f3dbc": [null, null, "task: customize the colors of the Messenger app.", null, "Task: Change the date and time format in the messenger app.", "task: Unblock a previously blocked phone number in messenger.", "task: change the font size in the Messenger app to medium.", null, "task: customize notification settings for the Messenger app.", "task: Adjust lock screen notification settings for sender and message visibility on Messenger.", null, "task: Enable character counter for writing messages in Messenger settings.", null, "task: Remove accents and diacritics from outgoing messages in the messenger app.", "task: customize settings to enable or disable sending messages on pressing Enter.", "Task: Enable delivery reports for outgoing messages in the Messenger app.", "task: Change the setting to send long messages as MMS in Messenger.", "task: Enable or disable sending group messages as MMS.", "task: Resize the sent MMS images to a size of 600KB."], "06d12a81a984d165f6107d52300085d901815170a2c6546fc7129a5ff30b88da": [null, "Task: Customize the theme and color settings of the Messenger app to use the Dark theme.", "task: customize the text color of the messenger app.", "task: Change the background color of the messenger app.", "task: change the primary color of the Messenger app.", "Task: Customize the app icon color in the Messenger settings.", null], "db8da4c4aed69c1ee76c3c58386edc9a9b8924ab9d096893dc87ae36659c73bb": [null, "task: customize the color theme of the Messenger app to a dark theme.", null], "ee4bc85165d8e30eb0e6662bbd800d46bbbc7663b2262c79288c29040a6fb67d": ["Task: Change the theme of the Messenger app to dark mode and disable the auto light/dark mode setting.", "task: change Messenger app theme to dark and uncheck the option for light theme.", "task: Change the theme color of the messenger app to dark and disable the dark mode.", "task: change the messenger app's interface theme color to dark and select the option for dark red.", "task: change the messenger app theme color to dark and uncheck the option for white theme.", "task: Change the Messenger app interface theme to Dark and enable the Black & White color scheme.", "task: customize the colors and theme of the messenger app's interface.", null], "e4bc83f77703f52d07cd5f9ca5fb500d16741aefd16d4f6f35002bd13525c940": ["Task: Change the date and time format in the Messenger app settings.", "Task: Change the date and time format to display \"16/02/2021\".", "task: Change the date and time format in the Messenger app to display the date as 02/16/2021.", "task: Change the date and time format to display as 16-02-2021 in the messenger app.", "task: Change the date and time format to '02-16-2021' in the messenger app settings.", "Task: Change the date and time format settings in the Messenger app to display the date as \"2021-02-16\".", "Task: Change the date and time format in the Messenger app.", "Task: Change the date and time format to display \"February 16, 2021\" on Messenger.", "Task: Change the date and time format to use 24-hour time format.", "task: Change the date and time format in the messenger app.", "Task: Change the date and time format in the Messenger app.", null], "3e83705e7c9d64408cdea9bd3d2177519b7b17d7e8dad3e7d3b284ec021ab3e2": [null, "Task: Block a specific phone number from contacting the user on Messenger.", null, "task: Block messages from contacts that are not stored in the user's phone.", null, "task: Add a specific number to the blocked list for message-blocking preferences.", null], "cfcaa9fde736c6ea989cc2b0276999b7b3b73f542639e313c822f57f6cb9d85b": [null, null, null, "task: customize settings to block/unblock messages from contacts not stored in the phone.", null, null, null], "8cb53267caec91fabbc33f0d955e0bf2bf6cc77828de61266c59a8cd30a73e28": [null, null, "Task: Block a specific number or pattern from calling or messaging the user.", "task: Block a specific phone number from calling or messaging the user.", null], "db6e86df53e103e7364fd7877a85997eea5d7a824e32429a7aad70b18592439c": [null, null, null, null, null], "67da643374d1ea3b0edd5022f9c3612822bdc41a9934c0307142479a64383462": ["Task: Adjust the font size of the Messenger interface to \"Medium\" and deselect the option for the \"Small\" font size.", "task: change the font size of the messenger interface to a smaller option.", "task: change the font size of the messenger interface to \"Large\" and save the settings.", "task: Change the font size of the Messenger interface to Medium and disable the option for Extra Large font size.", null], "7f8f88b0be7d1235a51b2a6567e05258bc0114a0283a6883c64a7e97eec69434": ["Task: Customize SMS notifications and notification preferences in the Messenger app.", null, "Task: Customize messenger notification preferences and search for specific settings.", "Task: Customize SMS notification preferences for the Messenger app.", "Task: Customize SMS Messenger notifications and adjust notification preferences in the messenger app.", null, "Task: Customize the notification settings for the Messenger app on their smartphone.", "Task: Enable notification dot for advanced notification preferences in Messenger settings.", null], "311608c2891e76079df1e5cfbee8493d1656731b172ee94afeccf4271ca808b0": [null, null, "task: customize notification settings and search for specific settings in messenger.", null, null, null, null, "task: Enable notification dot for advanced customization and management of messenger settings and notifications.", null], "53c3b0e72f4d2d7d3bcf4bab3db7744ff7965cac25f88801fc289c3c2d08c4cd": [null, null, "task: Adjust the notification settings for SMS messages in the Messenger app and search for specific notification settings.", null, null, null, null], "49deca6e3d4b444e2853743b76aa898bd0ba76cd8188f141c1bf8ccd7c6eeecb": ["task: customize lock screen notification visibility for sender and message display in Messenger app.", "task: customize lock screen notification visibility to display only the sender.", "task: customize lock screen notification visibility for sender and message in Messenger app.", null], "ed52ffd458f2d820697aeecc26d5fd3e9edbba87d5fa8a4f2c57eadd368ee196": ["Task: Import messages from another app or device to the Messenger app.", "task: export messages", null], "6c15d08aec3a402a628f85b3d96898a6db9ec6b7d2e522ba14ac3fe2c8365d0f": ["task: Import large message files from other apps.", "task: Import messages from the current week into the messenger app.", null, "Task: Import messages from a messaging app to the user's Drive storage.", "task: Import messages from another app or source into Messenger.", null, "Task: Import messages from another app and view them in a grid format.", "task: import messages and show root folders for file management purposes.", null, "task: search for specific messages in the Messenger app and manage or browse through imported messages.", null, null, null], "537c4da87ea34a8ba644cc023a5aedaf47cb878268794131767c7c75b55974e1": [null, null, "task: export messages (SMS and MMS) with a specific name, excluding SMS messages.", "task: Export messages (SMS and MMS) with specific name, excluding MMS, and either cancel or confirm the export.", "task: export SMS and MMS messages with a specific name, but the user cancels the operation.", "task: export messages (SMS and MMS) with a specific name, confirming the export process.", null], "ba07083063ba3308faf997627f22ac6c3209c35b90fded27bf0bf78b5bf3f761": [null, null, "task: export and save messages in list view format for further use.", "task: export and share messages from the messaging app.", null, "Task: Organize and save downloaded messages from the messaging app into a new folder.", null, null, null, null, null, "task: export and save messages from the messenger app.", null], "252f1ed8f3f2e6bea622548f42e08abaa95d491a26cfb66fda2ce8147d66cc07": [null, null, "task: Find answers to frequently asked questions about the Messenger app.", "Task: Contact the support team via email.", null, "Task: Gather information about the contributors of the Messenger app.", "Task: Donate to a cause or organization through the messenger app.", null, "Task: Access the Facebook page or learn more about Facebook.", "task: Access the GitHub page for Messenger to get more information or support.", "Task: Access information and features about Reddit through the \"About\" section on the Messenger app.", "task: Learn more about Telegram and its features.", null, null, "Task: Access the messenger's website for information, support, and various features.", "task: Read and understand the privacy policy of the messenger app.", "Task: View information and details about third party licences used in the Messenger app.", "task: check the details of the current version of Messenger app.", null], "90f22ebca5428993cd42caba9d0a720338e39370c3f4baffea0443917e5123d4": [null, "Task: Delete a message sent to Bob on June 30th.", "task: dial a number for Bob", "Task: add a person to the current chat conversation.", null, "Task: View conversation history or details with Bob on Messenger.", "task: send a message to Bob on 30.06.", "task: send a message or attachment to Bob on June 30th", null, null], "7443468cb5417a4b6c16fda63e6fdb94e631b4013cdce102105a8af7d0345da9": [null, "task: delete all messages in a conversation with Bob", "task: delete all messages in the conversation with Bob.", null], "26108775822161a65b119b22f8e935bad3582d1b70034007d4dcc841cf993a89": [null, null, null, null, null, null, null, null, null, null, null, null], "428b067bee33b9f544af41f20f7740ca0d7109904f4b61cd79e50d5ea90d1f20": [null, "task: delete a message from Alice received on 30.06.", "Task: Call Alice on June 30th.", "task: Add a person to the messaging interface by clicking on \"Add Person\".", null, "Task: View and respond to a message or conversation from Alice on June 30th at 12:18 PM.", "Task: Send a message to Alice with the content \"Hello\" on June 30th.", "Task: Sending a message to Alice with an attachment on Messenger.", null, null], "552d30f235e58ed1f603339ad1897b0df260b1dad80bb75397a1cd8e0d34322c": [null, "task: make a phone call to Alice and add her number to contacts.", "task: make a phone call to Alice and add her number to contacts.", "task: Make a phone call to a contact named Alice on June 30, using the dialpad by entering the letter A.", null, "Task: Make a phone call to \"Alice\" using the number \"130.06\".", "task: make a phone call to the number 2-ABC and add that number to contacts.", "task: make a phone call to the number \"3DEF\" and add it to contacts as \"Alice\"", "task: make a phone call to the number '4 GHI' and add it to contacts as Alice's number", "task: make a phone call to Alice, and add the dialed number (5) to contacts.", "task: Make a phone call to the number \"6\" using the dialpad.", "task: Make a phone call to Alice on the 7th of June.", "task: Make a phone call to someone named Alice on June 30th at 8.", "task: make a phone call to the number 9609-9999.", "Task: The user is trying to make a phone call by dialing a number and adding it to their contacts.", "task: make a phone call to Alice on June 30th and add the number to contacts.", "task: make a phone call to Alice on 30.06 and add her number to contacts, possibly related to a specific hashtag.", "Task: Call Alice, save her number, and navigate through the dialpad to make the call.", null], "467d921c37c70b9fd0d0f21ea8b93c3025ef4d0984d7aab6e67e6c940756c3e0": ["Task: Make a phone call and disable the microphone during the call.", "task: make a phone call to Alice and turn off the speaker.", "task: make a phone call to Alice on June 30th.", "task: make a phone call and put it on hold.", "task: make a call to Alice", "Task: Make a phone call to Alice on 30.06.", null, null, null, null], "59cac8dcd2b99fd48bbe9c8c6137d1aa71fff71ebcb8018b8429b10094246a70": [null, "Task: Dial a phone number and add the number to the contacts.", "Task: Call or initiate a phone call to Bob.", "Task: Start a call with a contact named Bob.", null, "Task: Dial a phone number starting with the digit 1.", "Task: Dial a phone number starting with the digits \"2\" and containing the letters \"ABC\" in its associated buttons.", "Task: Dial a phone number or add a phone number to the contacts list with the name \"Bob\".", "Task: Dial the phone number corresponding to the contact named Bob.", "Task: Dial the number 555", "Task: Dial and call the phone number 6 from the contact list.", "Task: Dial a phone number starting with the digit \"7\" related to Bob on June 30th.", "Task: Dial a phone number starting with the number 8 from the contact list.", "Task: Dial a phone number with the digits \"9\" and \"WXYZ\".", "task: Call Bob on June 30th.", "Task: Dial a phone number starting with a zero and a plus sign.", "Task: Call someone with the phone number containing the hashtag \"#30.06\".", "Task: The user is trying to call a phone number saved as \"Bob\" on Messenger.", null], "33261b024cf187d44cfbd77ea3cc0b387c9dc6a7ca8739e8c64c9449cb33976d": ["task: Make a call to Bob and turn off the microphone during the call.", "task: make a call to Bob and turn off the speaker.", "task: call Bob on messenger.", "task: Place a call to Bob and then put the call on hold.", "task: make a phone call to someone named Bob on June 30th.", "task: make a call to Bob and end the call.", null, null, null, null], "9ffbb234505400b8464dea1efcb086d4a7b9be36e8cbadae0702e4e3638808e9": ["task: view conversation details for a chat with user named Bob.", "task: block a phone number in the messenger app", "task: mark a conversation with Bob as unread in the messenger app.", null], "1ff357d72e3942a54f08f90fc68dfb6f5d17173b2c4452ab971173531a631865": [null, null, "task: view conversation details and manage members in a conversation with Bob.", null, "Task: View conversation details and member information for the chat with contact 222222.", null], "57dbf7976f8da04fd5b1dbb9c2b48f8c435da96972de49c9a4770dd160a7aa52": [null, null, null, "task: view conversation details and rename conversation name for Bob in messenger app.", "task: change the conversation name with Bob in the messenger app.", null], "8fcf44ade1880e68dc7af01f764ae99507e0fc4966a991ed70e79814a74b6a08": [null, "task: Add or remove a contact with the phone number 222222 from favorites.", "task: Send an email to contact 222222 with the conversation details.", "task: Call contact 2222222222", "Task: Send an SMS to contact Bob with the message \"Hey\" on June 30th.", null, "task: View conversation details and contact information for the number 222222 (possibly a mobile number).", "task: view conversation details and contact information for Bob.", "Task: View the conversation details and phone storage for the contact \"222222\".", "task: edit contact details for the conversation with 222222.", "task: Share the conversation details of the message with \"222222\".", null, null, null], "f818b4c205c94b8578791e62b5352f3349b4bc4345ecda977fe8158449018067": [null, null, "task: view the conversation details and members for the conversation with Alice.", null, "task: view conversation details, including conversation name and members.", null], "e131e93f5e9876af5d1d17d63a70b5a135f1dfc93972683f1af1eef3a7388748": [null, "task: mark conversation with 111111 as favorite.", "task: Send an email to the contact with the phone number 111111.", "task: call contact Bob on 30.06.", "task: send an SMS to the contact named Bob, with the message \"Hey 30.06\".", null, "task: edit the conversation details for the contact with the phone number 111111.", "task: view conversation details between Bob and alice@mails.com", "task: View conversation details with Bob and access phone storage for messaging.", "task: edit the contact details for the conversation with Bob.", "task: share a conversation with contact 111111.", null, null, null]}, "calendar": {"b037bd18f22672a681a11f31d2309ba4f48e3941ff9ac63a6a164e72ee9dc5d0": [null, "task: search for specific events or find events based on certain criteria", "task: Change the view of the calendar.", "task: access additional options and settings for managing events in the calendar app.", "Task: View events or manage events in the calendar for the month of July.", "task: create a new event on the calendar.", null], "41fab8a8229a01a4c4c0872b6e5932eaf07f8213f9a950020253a3a4f0f484b3": ["task: Change the calendar view to daily view", "Task: Switch to weekly view in the calendar app.", "task: switch to a different view in the calendar and navigate back.", "Task: Change the view of the calendar to \"Yearly view\" and navigate back to the previous screen.", "task: change the view of the calendar to a simple event list.", null], "e77ab12715745be71108b1340969dc8973018a73602438535093fc51ab6aab28": [null, "task: Search for events and change the view to a simple event list.", null, null, null, null, null], "5a8d35cb1aa3694db466af3da76abf3d6fb93c837d671488805cab44910e9c38": [null, null, "Task: Change the calendar view to a monthly view and switch to a simple event list.", null, "task: switch between different views of the calendar and toggle the display of a simple event list.", null], "a0580636289877f1e38e3d0fb2dc819e0bafcdaa9cfe463ed66522d8f283685a": ["Task: Search for specific events or appointments in the calendar.", null, null, null, null, "Task: Search for a specific event or appointment in the calendar.", null], "5534c66d5f37c0f29958ac89e66254fa62b5e261bf014a6fb71d9aa78a75d4b3": ["task: add holidays to the calendar", "Task: Add contact birthdays for managing events and keeping track of birthdays and anniversaries.", "Task: Add contact anniversaries to the calendar.", "task: Import events from an .ics file.", "task: export calendar events to an .ics file", "task: adjust settings and preferences for the calendar app.", "Task: Access information about the app, such as managing events, adding holidays, birthdays, and anniversaries, importing/exporting data, and adjusting settings.", null], "d153f77cd44709997f1a7e9d001e3e4724b767b98d985b994cdefd5ace2fc89b": ["task: Add holidays for Algeria to the calendar.", "Task: Add holidays for Argentina to the calendar.", "Task: Add holidays to the calendar and select Australia as one of the countries for display.", "Task: Add holidays in Belgium to the calendar display.", "Task: Add holidays for Bolivia to the calendar.", "Task: Add holidays from Brazil to the calendar.", "task: Add Canadian holidays to the calendar.", "Task: Add Chinese holidays to the calendar.", "Task: Add holidays from Colombia to the calendar display.", "task: add holidays for Česká republika to the calendar.", "task: Add holidays from Danmark to the calendar.", "task: Add holidays to the calendar and select Germany as one of the displayed countries.", "task: add holidays from Eesti to the calendar.", "task: add holidays for Spain to the calendar.", null, "Task: Add holidays from Éire to the calendar", "Task: Add holidays from France to the calendar display.", "Task: Add holidays to the calendar and specifically select Hanguk (Korea) as one of the countries for display.", "Task: Add holidays from Hellas (Greece) to the calendar display.", "Task: Select and add holidays to the calendar for the country \"Hrvatska\" (Croatia).", "Task: Add holidays for India to the calendar display.", "Task: Adding Indonesia holidays to the calendar for display.", "Task: Add holidays from Iceland to the calendar display.", "Task: Add holidays for Italy to the calendar.", "Task: Add holidays from Latvia to the calendar.", "Task: Select Lietuva as a country for holiday display on the calendar", "Task: Add holidays of Luxembourg to the calendar display and navigate back to the previous page.", "Task: Add holidays of Makedonija to the calendar display.", "Task: Add holidays from Magyarország to the calendar.", "task: Add holidays for México to the calendar.", "Task: Add holidays from the Netherlands to the calendar.", "task: Adding holidays from Japan to the calendar.", "Task: Add holidays for the country \"Norge\" (Norway) to the calendar.", "Task: Add holidays for Austria to the calendar.", "Task: Add holidays of Pakistan to the calendar.", "Task: Add holidays for Poland to the calendar.", "Task: Add Portugal holidays to the calendar.", "task: Add holidays from Russia to the calendar.", "Task: Add holidays to the calendar and select Romania as one of the countries to display.", "Task: Add holidays for Switzerland to the calendar display.", "task: Add holidays to the calendar and select Serbia as one of the countries to display.", "Task: Add holidays of Slovenia to the calendar.", "task: add holidays for the country \"Slovensko\" to the calendar.", "Task: Add South African holidays to the calendar.", "Task: Add holidays for the selected country (Suomi) to the calendar display.", "Task: Add holidays from Sweden to the calendar view.", "Task: Add holidays to the calendar for the country Ukraine.", "Task: Add United Kingdom holidays to calendar.", "task: Add holidays from the United States to the calendar."], "0dfcd2ff9939bb98a09aca5707c630569835c9f6d66e24ea1e2d8dc53229c7a6": [null, "task: add contact birthdays to the calendar.", "task: Manage calendar permissions for adding contact birthdays and deny the permission.", null], "ee9f0855b6686a9d0bd515c215315d215fa6d3438addbaf227d25e19eaa3185a": [null, "task: Importing events from an .ics file to the user's calendar.", "task: Prevent the calendar app from importing events from an .ics file.", null], "4927876f7234d01f13659cbd78612b2d37be153f11f451ff6ed0a731a0aff240": [null, "task: Import events from an .ics file into the calendar.", "task: import events from an .ics file and set alarms for them.", "Task: Import events from an .ics file on Android.", "task: import audiobooks from an .ics file and manage them.", "task: Import multiple events from an .ics file located in the DCIM folder.", "task: Import events from an .ics file and view the documents in the \"Documents\" folder.", "task: Import events from an .ics file and download 1 event item.", "task: Importing movie events from an .ics file into the calendar.", "task: Import an .ics file to add events to the calendar and browse/manage music files.", "task: Import events from an .ics file and enable notifications for them in the calendar app.", "task: Import events from an .ics file and view pictures.", "task: import an .ics file to the calendar and browse podcasts with 0 items.", "task: Import events from a .ics file to the calendar.", null, "task: import an .ics file for events and set a custom ringtone.", "task: Import an .ics file into the calendar.", "task: Import events from an .ics file into the calendar."], "0fbb9314ecc2dc97537efa196c898becd9cc76bd2bde96ea0f569c03fc7be33d": [null, null, "task: Import events from an .ics file and set alarms for them in the calendar app.", null, null], "88f29884fb5eacc4d8ce762764b2b603ed48812c458991e3abd38bffb6201dff": [null, "task: Export calendar events to an .ics file in the Internal folder.", "Task: Export calendar events to an .ics file and set alarms for 0 items.", "task: Export calendar events to an .ics file on an Android device.", "task: Export calendar events to an .ics file and access audiobooks with 0 items.", "task: Export events from the calendar and save them as an .ics file in the DCIM folder.", "task: Export calendar events to an .ics file and save it in a specific folder or location.", "Task: Export calendar events and download them as an .ics file.", "task: Export the user's calendar events to an .ics file and view movies with 0 items.", "task: export calendar events to an .ics file and select music to be included.", "task: export calendar events to an .ics file and manage notifications.", "Task: Export calendar events to an .ics file and select pictures for the export.", "Task: Export calendar events as an .ics file and access the Podcasts section", "task: Export calendar events to an .ics file and then cancel the export process.", "task: Export events from the calendar and save them as an .ics file.", null, "Task: Export calendar events to an .ics file and set a custom ringtone for notifications.", "task: Export calendar events to a file in .ics format.", "task: Export calendar events to an .ics file and navigate to the screen_2023-06-30_143638.png file for confirmation or selection."], "44320aacba99d74a471c8ea105cb386326fa93cf80b9334a4b9ae86181eebfbd": [null, null, "task: export calendar events to an .ics file and manage alarms in the internal/alarms folders of the selected calendar folder.", null, null, null], "6c4d5e9b3856a2505fed43c416dca9ffb02b886db89fcb0c3bfd1fab26ee24eb": [null, null, "task: search for a specific event or task in the calendar.", null, null, null, "task: search for an event or appointment in the calendar.", null], "e5bb0f7b3eb647b48936f7e4e35769d570c6ae713970b911aa4297f24275ca7f": ["task: Customize settings, reminders, CalDAV sync, views, event lists, and widgets for calendar app.", null, "task: customize the colors for the calendar app.", "task: Customize event types for the calendar app.", "task: Change the time format to 24-hour format in the calendar app.", "task: Change the start day of the week in the calendar app to Monday.", "Task: Disable the \"What's New\" feature on the calendar app startup.", "Task: Delete all events from the calendar.", null, "task: Disable vibrate on reminder notifications in the calendar app.", "task: customize the reminder sound for the calendar app.", "Task: Customize snooze time settings for calendar reminders.", "task: adjust snooze time for calendar reminders to 10 minutes.", null, null, "task: Enable CalDAV sync for the calendar app.", null, "task: customize the start time of the day in the calendar app to 07:00.", "Task: Adjust the end time of the user's calendar day to 23:00.", null, "Task: Disable the display of week numbers in the calendar app's settings.", "task: customize the settings and appearance of the calendar app by disabling the grid view.", null, "task: customize settings for the calendar app, specifically the option to replace event description with location.", "Task: Customize the calendar settings to not display past events.", null, "task: customize the font size for the calendar app."], "a39f4e7423a7ec05e4957e3d2f62cdb8ac8603374c98ce2944ecd1ebe401a96c": [null, null, "task: change the calendar theme to dark mode", "task: change the text color for the calendar app on the smartphone.", "Task: Change the background color of the calendar in all apps on the smartphone.", "task: Change the primary color for the calendar app in the smartphone.", "Task: Customize the colors of the calendar app for all other apps on the smartphone.", null], "b555610691d75afd1c4cb87308b58d4f99273beea38325be444d78c94e28d986": [null, "task: customize the colors for all Simple Apps in the calendar", "task: customize the color scheme for all Simple Apps in the calendar.", null], "aa57b74d867f195506afa45cddabf5199e67a99c324d7b1737200c1a9ec959e5": ["task: customize the calendar theme to \"Dark\" and uncheck the \"Light\" theme.", "Task: Customize the calendar theme to \"Light\" and go back to the homepage.", "Task: Customize the calendar theme and select the \"Dark red\" option.", "task: customize the calendar theme to \"black & white\" on the smartphone app.", "Task: Customize the theme of the calendar app to \"Dark\" and select the custom option.", null], "1f858da570d72fc2746e7cd21ac2951b72173dc7602f9d9e106fff093ce451d1": [null, null, "task: customize the color and theme of the calendar app to a dark theme and uncheck the light theme option.", "task: customize the colors and theme of the calendar app to the Light theme.", null, null, null, null, null], "6d9c92d565fb64f096c91972078aff8091e9454266126dceb64773451254deb7": [null, null, "task: add a new event type to the calendar.", "task: Add or edit holiday events in the calendar.", "task: add a new regular event type to the calendar.", null], "5e6d92c26cdd25bb7b5aaa78ee87746384f33a49cfdd9f7ce93810c348652f34": [null, null, null, "Task: Create a new event type for the calendar with title, color options, and perform actions like save or discard.", "task: add a new event type to the calendar with title, color options, and perform actions like save or discard.", null], "e76daded6e1b908aa09b51fe2d2bc59c51805cfd8410d347e5948abcf409f865": [null, null, null, null, "Task: Cancel the creation of a regular event in the calendar.", "Task: Edit the title, type, color, and save changes for a regular event in the calendar.", null], "26c75e39ef6829993b7623d3fba5f203bfb6b9bb5372a6cb912330f3b11d6693": [null, null, null, null, null, null, null], "b030be607a7b965b12afa6b526f698a0c2a454938b56bb9753a0eed6516a4aa6": [null, "task: delete all events on the calendar", "task: delete all events from the calendar", null], "1d37b5a0628f5da09a91909ab5aa8fb175ef4f5e000c8e7b2baa06df4938b113": [null, "task: Change the reminder sound for calendar notifications and add a new sound option to select from.", null, "Task: Change the reminder sound for calendar notifications to \"No sound\".", "task: change the default reminder sound for calendar notifications.", "Task: Change the reminder sound in the calendar app settings to Adara.", "task: Change the reminder sound in the calendar app to Aldebaran instead of the default Pixie Dust.", "task: Change the reminder sound for calendar events to \"Altair\" in the app's settings.", "task: Change the default reminder sound for the calendar app and select Alya as a reminder contact.", "task: Change the default reminder sound in the calendar app to \"Antares\".", "task: Change the notification sound for calendar reminders to \"Antimony\".", "task: Change the calendar app settings to set the reminder sound to \"Arcturus\".", "task: Change the reminder sound to \"Argon\" in the calendar app settings.", "task: change the default reminder sound for calendar notifications.", "Task: Change the default reminder sound in the calendar app settings.", null, "task: change the default notification sound to \"Beat Box Android\" in the calendar app settings.", "task: Change the reminder sound for the calendar app to \"Bellatrix\" from the default \"Pixie Dust\".", "task: Change the reminder sound setting of the calendar app to \"Beryllium\".", "task: change the default reminder sound for calendar notifications to \"Betelgeuse\".", "task: change the default reminder sound to \"Caffeinated Rattlesnake\" in the calendar app settings.", "task: Change the reminder sound for calendar events to \"Canopus\" instead of the default sound \"Pixie Dust\".", "Task: Customize reminder sound for calendar reminders to use the Capella sound option.", "task: Customize calendar app settings, specifically the reminder sound option and enable/disable the Captain's Log feature.", "task: customize reminder sound for calendar events and select Castor as the new notification sound.", "task: Change the default reminder sound for the calendar app to \"Ceti Alpha\".", "task: change the default reminder sound in the calendar app to Cobalt.", "task: Change the default reminder sound to \"Cricket\" in the calendar app settings.", "task: change the reminder sound from the default (Pixie Dust) to Dear Deer in the calendar app settings.", "task: change the reminder sound for the calendar app and enable the notification for the Deneb event.", "task: Change the default reminder sound to \"Doink\" in the calendar app settings.", "task: change the reminder sound for calendar notifications in the settings.", "task: manage calendar app settings, specifically selecting the reminder sound \"Drip\" as the default notification sound.", "task: change the reminder sound for calendar notifications to \"Electra\"", "task: change the default reminder sound for the calendar app and enable the Fluorine notification sound.", "task: Change the reminder sound for calendar notifications to Fomalhaut.", "task: customize reminder sound for calendar notifications and enable Gallium as the selected sound option.", "task: Change the reminder sound for the calendar app to \"Heaven\".", "task: Change the notification sound for reminders in the calendar app to Helium.", "task: Change the reminder sound for calendar events to Highwire.", "task: Change the calendar app's reminder sound to \"Hojus\" and configure additional settings.", "task: Change the default reminder sound in the calendar app to Iridium.", "task: Change the reminder sound for calendar notifications to \"Krypton\".", "task: change the default reminder sound for calendar notifications to \"Kzurb Sonar\".", "task: change the reminder sound to \"Lalande\" in the calendar app settings.", "task: customize the calendar app settings and set a specific reminder sound with the option of checking a \"Look At Me\" feature.", "task: Change the default reminder sound to \"Merope\" in the calendar app settings.", "task: Change the reminder sound for calendar events to 'Mira' and adjust app settings.", "task: Change the notification sound for missed reminders in the calendar app.", "task: Change the reminder sound for calendar notifications to \"Moonbeam\" instead of the default \"Pixie Dust\".", "task: change the default reminder sound for calendar notifications to \"On The Hunt\".", "task: change the reminder sound for calendar notifications to Palladium.", "task: customize reminder sound for calendar events to Pixie Dust and enable the notification sound.", "task: Change the default reminder sound to \"Pizzicato\" in the calendar app settings.", "task: Change calendar app settings to set a reminder sound for events and potentially enable a reminder for a plastic pipe-related task.", "task: Change the reminder sound for calendar notifications to Polaris.", "task: change the reminder sound for calendar notifications to Pollux.", "task: change the reminder sound for the calendar app to \"Procyon\".", "task: Change the reminder sound for calendar events to \"Proxima\" and adjust the app's settings.", "task: change the reminder sound for calendar notifications to 'Radon'.", "task: Change the reminder sound for calendar events to \"Regulus\".", "task: Change the reminder sound for calendar notifications to Rubidium.", "task: change reminder sound for calendar notifications to \"Selenium\" and manage other calendar app settings.", "task: Change the reminder sound for calendar notifications to \"Shaula\".", "task: change the default reminder sound in the calendar app to \"Sirius\"", "task: change the default reminder sound for calendar notifications to \"Sirrah\".", "task: Change the default reminder sound for calendar notifications to \"Space Seed\".", "task: Change the default reminder sound for calendar events to \"Spica\".", "task: Change the reminder sound for calendar notifications and select the \"Strontium\" sound.", "task: Change the reminder sound for calendar events to Syrma."], "2563cd0132df7babcf5f9118008656bfd16c87e3d799ad0d679adbe9d56e76d1": ["task: adjust the snooze time for calendar reminders to 10 minutes and enable a 1-minute reminder interval.", "Task: Adjust the snooze time for reminders to 10 minutes and enable the option to snooze for an additional 5 minutes.", "task: Adjust snooze time for reminders in the calendar app to be 10 minutes.", "Task: Set a reminder with a snooze time of 10 minutes and an option to snooze for 30 minutes.", "task: set the snooze time for calendar reminders to 10 minutes and enable the 1-hour interval option.", "task: adjust snooze time for calendar reminders to 10 minutes and set a custom time interval.", "task: set a snooze time of 10 minutes for reminders.", null], "43ff20b2170ac83f282914166cb4a238dc44227ee2e1538042496fe067962d47": ["task: Customize calendar settings to display events from the past and disable reminders for the last minutes.", "task: set a reminder to display events from the past, never show hours, and confirm duration.", "task: Set a reminder and customize the settings for displaying past events in the calendar.", "task: Adjust the settings for the calendar to stop displaying events from the past.", "task: Change the settings to display events from the past as \"Never\" in the calendar app.", null], "37d74d294f771243b96af3e6e82d1a7b7295b06891f76c69b80a96ed5d4f1930": ["task: adjust the font size of the calendar view", "task: Adjust the font size of the calendar view to medium.", "task: change the font size of the calendar to Large.", null], "77dfea11565b42a31fee51cb52720d35ec189b30db4c597fd2ea88af5f833b2e": ["task: create a new calendar event with reminders and repetition options.", null, "task: create and save a new calendar event with reminders and repetition options.", null, null, null, "task: create a new calendar event with reminders and repetition options", "task: create a new event on July 1 with reminders and repetition options.", "task: create a new calendar event at 12:00 PM with reminders and repetition options.", "task: create a new event on July 1st with reminders and repetition options.", "task: Create a new calendar event at 12:00 PM with reminders and repetition options.", "task: create a new calendar event with a reminder set to 10 minutes before the event", "task: create a new calendar event with multiple reminders.", "Task: Create a new calendar event without any repetition for a specific date and time.", "Task: Create a new regular event in the calendar with reminders and repetition options.", null], "1de405d94a0dc161d25004ddbf768abf707e415a63851c67ba42d90234788c52": ["task: create a new event on July 1, 2023.", "task: create a new event on July 1st", "task: create a new event on July 1, 2023, and view the details.", "task: create a new event on July 2, 2023.", "task: create a new event on July 3, 2023.", "Task: Create a new event on July 4, 2023 on the calendar.", "task: create a new event on July 5, 2023", "task: create a new event on July 6, 2023", "task: create a new event on July 7, 2023 in the calendar.", "task: create a new event on July 1, 2023", "task: schedule a new event on July 9, 2023 using the calendar app.", "task: create a new event on July 10, 2023", "task: create a new event on July 11, 2023 for the user's calendar.", "task: schedule a new event on July 12, 2023.", "task: Create a new event on July 13, 2023 in the calendar.", "task: create a new event on the calendar for July 14th, 2023.", "Task: Add a new event to the calendar on July 15th, 2023.", "task: add a new event on July 16, 2023", "task: Create a new event on July 17, 2023, for the selected date.", "task: create a new event on July 18, 2023.", "task: create a new event on July 19, 2023", "task: create a new event on July 20, 2023.", "Task: Create a new event on July 21, 2023 in the calendar.", "task: create a new event on July 22, 2023.", "task: create a new event on July 23, 2023.", "Task: Create a new event on July 24, 2023 in the calendar.", "task: create a new event on July 25, 2023.", "task: create a new event on July 26, 2023", "task: create a new event on July 27, 2023 on the calendar.", "task: create a new event on July 28, 2023.", "task: Create a new event on July 29, 2023", "task: create a new event on July 30, 2023", "task: create a new event on July 31, 2023.", "task: create a new event on July 1st and navigate to the previous month.", "task: create a new event on July 1st and then navigate to the next month.", "task: create a new event on July 1st but then cancel it.", "task: create a new event on July 1st.", null], "05f8de41ce1b0c123111ea9222baa9416ddd440d57599ff16b55009df43ffc0e": ["Task: Create a new event in the calendar and set the time to 12:00 PM.", null, "task: create a new event in the calendar at 12:00 PM.", "task: Create a new event in the calendar for 12:00 PM.", "Task: Create a new event in the calendar at 12:00 PM and change the time from PM to AM.", null, null, null, null, null, null, null, null, null, null, null, null, "Task: Create a new event on the calendar at 12:00 PM and switch to text input mode for the time input.", "task: schedule a new event at 12:00 PM, but then cancel it.", "task: create a new event in the calendar for 12:00 PM", null], "7be671f67b12a11b3a667b6780e9e80104be5d122c8a534c1584af702c2fd5f7": ["Task: Create a new event in the calendar with a reminder set to 10 minutes before, without any notification.", "Task: Create a new event in the calendar with a reminder set for 10 minutes before the event starts.", "task: create a new event in the calendar with a reminder set 10 minutes before the event and an additional reminder 1 minute before the event.", "Task: Set a reminder for a new event in the calendar, with a reminder notification 10 minutes before the event and an optional reminder 5 minutes before.", "task: create a new event and set a reminder for it 10 minutes before.", "task: Create a new event in the calendar with a reminder set for 10 minutes before the event and an option to also set a reminder for 30 minutes before.", "Task: Set a new event in the calendar with a reminder 10 minutes before and an additional reminder 1 hour before.", "Task: Create a new event in the calendar and set a reminder for it to alert the user 10 minutes before the event starts, with customizable options.", null], "67d7de90b58f15bd10b1849244985f177aca5e5185efb840cdf4abb0929d3b22": ["Task: Create a new event in the calendar and set the repetition frequency for the event.", "task: create a new daily event on the calendar.", "task: create a new event in the calendar with a weekly repetition frequency.", "task: create a new event in the calendar with a monthly repetition frequency", "task: create a new event in the calendar and set the repetition frequency to yearly.", "task: create a new event in the calendar with custom repetition frequency.", null], "08c085a404864d3a0aba71a1700a518fde0caa977a5caaca413b3e1a650f4f17": ["Task: Create a new regular event for the calendar, excluding holidays.", "Task: Create a new regular event and customize its options in the calendar.", "task: create a new regular event and add a new type to the calendar.", null], "6d7a2042bf7d436d87f1070d8cda34b6188388bcc1a16b399a21429cbb8ca598": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null], "fc730a8bba08c33a902a3a4119cea4ff4808d5d2449e228761d5a2ef73867d5c": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null]}, "notes": {"8dea304280d163f83acfaf5361f23bd69f0ee73b1e8d49e8b209e51e2f701476": ["task: search for a specific note in order to view, edit, or manipulate its content", "task: open a specific note", "task: create a new note", "task: manage and organize notes, possibly searching, opening, and creating new notes.", null, "task: create a general note", null, null], "67f3b94e0e34c3430a429ef07289bd7b94c6e3b80719e6fc9d839c0f23ad3b4f": [null, null, null, "task: Create a new checklist note with label and actions.", "task: Create a new note with label, type (text or checklist), and actions (cancel, ok, go back).", "task: create a new note with label, type (text or checklist), and actions (cancel, ok, go back).", "Task: Create a new note with specific label, type (text or checklist), and actions (cancel, ok, go back).", null], "1d832e8a3eaca63650806e61bb2e4d6707fb07d077e168297e487f58db9692eb": [null, null, null, "task: Create a new note with options for a checklist or text note.", "Task: Create a new note with a checklist, and update the checklist by unchecking an item.", null, null, null], "31b21e28301a234ddcc1a929aae1a0994e9f678f5fc9ed621e8123c4519d926d": ["task: search for a specific note or topic in the general note section.", null, null, null, "task: Create a new general note or diary entry in the notes app.", null, null, null], "7efdbef7ed868349f608932f3bdef34ceee6c77fe26bd575357b5c22f83861f9": [null, "task: open a note and uncheck the \"Diary\" category for that note.", "Task: Open a general note.", "Task: Create a new note.", null], "d30d629d793bfe53cdcfb3f2984315c78089bafee2ba0f45ef8bc2c0dcf7909a": ["task: rename a note", "Task: Share a note.", "task: create a shortcut for a note.", "task: lock a note.", "task: import/export a note.", "task: import notes into the notes app", "task: export a note as a file", "task: export all notes from the notes app.", "task: print a note", "task: delete a note", "task: modify note settings", "task: view information about the notes app (such as version, developer, etc.)", null], "d85b7ab3ab074ba9075255e6c07f590bcb9b0a4311164df52f1242687e153a6a": [null, null, "Task: Rename a note, but then decide to cancel the renaming process.", "Task: Rename a note and confirm the action by clicking \"OK\".", null], "7d6f87374454c95a2e08dfacd3fe1b4e068626e1a9954723d191796f50bf3453": [null, null, null, "Task: Add a shortcut for the Notes app to the user's home screen.", "Task: Add a shortcut for the Notes app to the home screen manually or automatically.", null], "116e30059d4712a3e2a39a6747be36968a1e2f72e53b9bcee1bcd1bc875aa030": [null, null, "task: export notes in list view as a file", "task: Export the notes as a file and view the root directory.", null, "task: Create a new folder and export a note as a file.", null, null, null, null, null, "task: Export and save a file from the notes app.", null], "960353b1affd0b2c421f0cf8a75b6497c066254fb9241986de5120bbd9c66082": ["Task: Export note file and save it after updating the content.", "task: Save and export the current file content from the notes app.", null], "4b612f04a7389c72db76762439ae114fd2ec88a0423ec423578228cee9eec7fe": [null, null, "Task: Export all notes in list view and manage downloaded files, create new folders, rename and save notes.", "Task: Export all notes and show the roots of the exported files.", null, "task: Export all notes, create a new folder.", null, null, null, null, null, null, null, null, "task: Export all notes and save them in the downloaded files folder.", null], "d8dc4abb0e56e5f4a2054cebed843fab68f8accaf9b3302aefe20c7e5204846d": ["task: Save note as PDF and adjust print settings (copies and paper size) for printing.", "Task: Save the notes as a PDF file.", "task: Print a note with 1 copy and paper size Letter.", "task: Print the note as a PDF document.", "Task: Save and print notes as a PDF document.", null], "fc6060f782647d6f5d40da6d29994f951b643b36ad707888bc79a8f35db6323c": [null, "task: confirm deletion or cancel deletion of a note.", "Task: Delete a note from the notes app.", null], "10bac2bd974bd90c0972427b375edb6ede4f05a45723e57273aa11236e226809": [null, null, "Task: Customize the colors of the notes app.", "task: customize the widget colors in the notes app.", null, "task: adjusting the font size for the notes app interface to be 100%.", null, "task: enable the word count feature in the notes app.", "task: enable the option to make links and emails clickable in the notes app.", "task: customizing the note's app settings to use a monospaced font.", "task: enable or disable Incognito mode for keyboards.", "task: disable line wrap in the notes app settings.", null, "task: customize the alignment of the text in the notes app to be left-aligned.", null, "task: change cursor position in notes to the end", "task: disable the keyboard from showing up automatically when starting the notes app.", "task: customize app startup options by enabling the note picker to show on startup", null, "Task: Disable autosave option for notes in the app's settings.", "task: Enable or disable the save success messages for the notes app."], "06d12a81a984d165f6107d52300085d901815170a2c6546fc7129a5ff30b88da": [null, "task: change the color theme of the smartphone app interface to dark mode.", "task: change the text color for the notes app.", "task: change the background color of the notes app.", "task: Change the primary color of the app interface.", "task: Change the app icon color for the smartphone app interface.", null], "db8da4c4aed69c1ee76c3c58386edc9a9b8924ab9d096893dc87ae36659c73bb": [null, "Task: Customize the theme colors to Dark in the Notes app.", null], "ee4bc85165d8e30eb0e6662bbd800d46bbbc7663b2262c79288c29040a6fb67d": ["Task: Customize app theme to dark mode and disable auto light/dark feature.", "Task: Customize the app theme to a dark mode and select the \"Light\" option.", "task: customize the app theme to dark mode and then revert it back to light mode.", "Task: Customize app theme to a dark mode with the color option \"Dark red\" selected.", "task: customize the color theme of the notes app to dark mode and uncheck the option for the color white.", "task: customize the color theme of the notes app and enable black & white mode.", "task: customize the app theme to the dark mode and check the \"Custom\" checkbox.", null], "cc0ad8171fb50c89daabf7d3bedd6473f809ff93cfca73750ae07b12b984dbaf": [null, "task: customize the widget colors in the notes app.", null], "19b0f2d1f0537d87dd631b7f6e2fb941b2ddd78db91d75c58c9b0eebe03a5177": ["task: change the alignment of the text from left to center in the settings menu.", "task: Change the alignment of the text in the notes to be left-aligned or centered.", "Task: Adjust the alignment of the text in the notes app to the left and deselect the option for right alignment.", null], "80c8894dd01fda61803f0495b6c15d7772ae5b80e449bce9fa9f211d475b9def": ["task: search for a note or diary entry.", null, null, null, null, null, null, null, null]}, "applauncher": {"3f9adbf098ff69152b801042222f25ddd612674644e5d20b4c3617b4c9e33b3f": [null, "task: Sort the smartphone apps", "task: toggle the visibility of app names in the smartphone app launcher", "task: Sort the smartphone apps", "Task: Access the calendar feature on the smartphone app.", "task: Take a photo using the smartphone's camera.", "task: set an alarm or check the time on the clock app", null], "7bd9e2ded8ae3ec34dffeefb946dad82da73e3a8c7d983d8eed62b7ba2093beb": [null, "task: customize the order of smartphone apps by sorting them based on a different criterion.", "task: Sort and customize the order of smartphone apps based on specific preferences.", "task: Sort smartphone apps in descending order.", "task: sort smartphone apps in descending order", "Task: Sort and customize the order of smartphone apps with ascending/descending options.", "task: sort smartphone apps in ascending or descending order based on a selected criteria.", null], "608e4b67482f27cc24df23c888549061dafa15a7d52121e7ffa8c674b43df46a": [null, null, null, null, null], "ca19303f69337e3b0304675f3593b6929a8f5e20f11c851c7caa0c01e2149f4c": ["task: change the number of columns displayed in the app launcher screen.", "task: customize the app settings", "task: view more options and learn about the app functionality.", null], "e85b04a69566e4dc7f6043bd6ddb896899f3bcc27abca6f9d2d938f92e1c79f2": ["Task: Adjust the number of columns for app layout and save the configuration.", "task: customize the app layout by selecting the number of columns", "task: customize app layout by selecting the number of columns to display on the homepage.", "task: change the number of columns in the app layout to 4.", "task: change the number of columns for app layout to a value other than 5.", "task: Change the layout of the app to display 6 columns on the homepage.", "task: Change the layout of the app homepage to display 7 columns instead of the default number.", "task: adjust the column count for the app layout to display 8 columns.", "task: customize the number of columns for the app layout configuration.", "task: customize the number of columns for the app layout and save the changes.", "task: customize app layout by selecting the number of columns.", "task: change the number of columns for app layout to 12.", "task: Set the number of columns for app layout to 13 columns.", "task: customize the number of columns for the app layout", "task: change the number of columns for the app layout and return to the homepage.", null], "c1b06bce7e23dd13a3288977fbdd55b3d1962a9bb93432a712321fd371f52bb7": [null, null, "Task: Customize the colors of the app", null, "task: Customize app settings to disable the option of closing the app when launching a different one.", null], "06d12a81a984d165f6107d52300085d901815170a2c6546fc7129a5ff30b88da": [null, "Task: Customize the color theme to Dark for the app interface.", "task: customize the text color for the app interface.", "Task: Change the background color of the app interface.", "task: Change the primary color of the app interface.", "task: Change the app icon color in the settings to customize the color theme of the app interface.", null], "db8da4c4aed69c1ee76c3c58386edc9a9b8924ab9d096893dc87ae36659c73bb": [null, "task: customize the app's color theme to dark mode.", null], "ee4bc85165d8e30eb0e6662bbd800d46bbbc7663b2262c79288c29040a6fb67d": ["task: Customize the color theme of the app and enable/disable the auto light/dark mode.", "Task: Change the app's theme to Dark and customize the color settings.", "Task: Customize the app's color theme to Dark and disable the Dark theme option.", "Task: Customize the app's colors and select the \"Dark\" theme with the \"Dark red\" color.", "task: Change the app's theme to dark, customize the colors, and check if the theme is now set to white.", "task: customize the app's color theme to dark mode with black & white accents", "task: customize and apply a dark theme for the app's interface.", null], "9b2ba9dc53a7270e73d743ee3edc4b225c224707db6116752f993347fa8eccd6": [null], "863cb466e6a7b76e3579075348e7500c30d85b1deecbd22fd9bad4fcb02cdbfb": ["task: Take a photo or record a video using the camera app with timer mode.", "task: Adjust camera resolution.", "task: adjust camera settings for capturing and viewing media.", "task: Record a video using the smartphone's camera, toggle between front and back camera, and view the recorded video.", null, null, "task: Take a photo or record a video using the smartphone's camera app.", "task: Take a photo using the camera app, toggle between front/back camera, and capture the photo.", "task: view the last captured media from the camera app.", null], "fb78df2efd2d0dae6fe2d27fc76d3c48cf2944110abca15ccb49178d2e962f30": ["Task: Explore more apps from the app launcher and access additional features, such as settings, about, timer, clock, alarm, and stopwatch.", "task: Adjust clock settings or configure clock preferences", "Task: Access information about the clock feature on the app and learn more about its functionality and purpose.", "Task: Set an alarm for 5:00 am.", "Task: Set a new timer on the clock app.", null, "task: set or modify an alarm on the smartphone.", "task: start/initialize the stopwatch on the smartphone app.", null, null]}, "clock": {"fb78df2efd2d0dae6fe2d27fc76d3c48cf2944110abca15ccb49178d2e962f30": ["task: explore more apps from the developer in order to discover additional clock and timer functionalities.", "Task: Adjust clock or timer settings and access information about the clock app.", "task: learn more about the clock app and its features", "task: set an alarm for 5:00 AM.", "task: create a new timer.", "Task: Set an alarm or timer or check current time and date.", "Task: Set or manage alarms using the clock app.", "task: Start and manage stopwatch function with options for settings and information.", null, null], "c6da5bca26734434e32e38c9887040ed4b3cd739dcc3901924cf5435d5889de3": [null, null, "Task: Customize the colors of the clock.", "Task: Customize the widget colors in the clock app.", null, "Task: Purchase additional features and customize settings for the clock app.", "task: Disable the feature that prevents the phone from sleeping while the clock app is in use.", "task: change the first day of the week for the clock app to Monday.", null, "Task: Adjust the maximum reminder duration for the clock to 5 minutes.", "Task: Disable the gradual increase of volume for alarms and timers in the clock settings.", "task: customize snooze time for alarms in the clock app", null, "Task: Adjust the maximum reminder duration for alarms or timers in the clock settings.", "task: adjust the snooze time for the alarm clock to 10 minutes.", null], "108039bf498ec6f740c32cae29e400b56a62c9be94fb8a0c87da58f54e61ca18": ["task: adjust the maximum reminder duration for the clock alarm to 5 minutes and check whether the reminder time is set to 1 minute.", "task: adjust the maximum reminder duration for the clock alarm.", "task: set the maximum reminder duration for the clock alarm to 5 minutes and check the option for 10 minutes as well.", "Task: Set the clock alarm to a maximum reminder duration of 5 minutes and check the option for a 30-minute reminder duration.", "task: set the clock alarm for a maximum reminder duration of 5 minutes and enable a checkbox for a 1-hour reminder option.", "task: Set the maximum reminder duration for the clock alarm to 5 minutes using the custom time selection.", "task: Change the maximum reminder duration for clock alarms to 5 minutes and confirm the settings.", null], "2563cd0132df7babcf5f9118008656bfd16c87e3d799ad0d679adbe9d56e76d1": ["task: adjust the snooze time for the clock app to 10 minutes and enable a one minute increment option for the alarm intervals.", "task: set the snooze time for the alarm in the clock app to 5 minutes.", "task: Change the snooze time interval for the clock app.", "Task: Set the snooze time interval for the clock app to either 10 minutes or 30 minutes.", "Task: Adjust the snooze time interval and set the alarm for 1 hour intervals on the clock app.", "Task: Adjust the snooze time for the clock app to 10 minutes and enable the custom settings for alarm intervals.", "Task: Set the snooze time for the clock app to 10 minutes.", null], "88b83f316a333199154fb1ad50c83943aea478deaf68b4f778cbfd3e257f7713": ["task: change the maximum reminder duration for setting a timer to less than 1 minute.", "Task: Adjust the maximum reminder duration for the timer to either 1 minute or 5 minutes.", "Task: Set the maximum reminder duration to 10 minutes in the clock app settings.", "Task: Set the maximum reminder duration for the clock app to 30 minutes.", "Task: Adjust the maximum reminder duration to 1 hour in the clock app settings.", "task: Set a custom reminder duration for the clock timer to be 1 minute.", "Task: Adjust the maximum reminder duration for a timer to one minute.", null], "e8d6ea2d2c622928441bd48f7d265f64d14c26665a18fdd92d2535e87abe4062": [null, "Task: Create a new timer with the option to enable vibration.", "task: create a new timer with default settings and select the clock style.", null, "task: create a new timer, but then cancel it.", "task: create a new timer with a specific alarm time, vibration settings, clock style, and label.", null], "b2ddbbfba7219a3fc8de3343b42be3211aa9902802bbb7b8c1f0149e06210499": [null, null, null, null, null, null, "task: set a timer.", null], "0fe4d8ae84dc5fed6fb0db2cfae8801722cc0594525a17b91585a9bb6658f07d": ["Task: Sort the alarms by a specific criteria or change the sorting order in the Alarm section of the app.", null, null, null, "task: Set an alarm for 7:00 am on Monday, Tuesday, Wednesday, Thursday, and Friday.", "Task: Set an alarm for 9:00 am on Sundays and Saturdays.", null, null, null, "task: Set a timer.", null], "9d99b0a713bd7cc17a913f7a8127df984fec4d4a9a8e7676f4891f144b126986": ["Task: Set an alarm for 7:00 am on Monday, Tuesday, Wednesday, Thursday, and Friday with sound and vibration enabled.", "task: Set an alarm for 7:00 am from Monday to Friday and label it as \"M\".", "Task: Set a recurring alarm for 7:00 am on Monday, Tuesday, Wednesday, Thursday, and Friday with the option to turn on vibration and customize the alarm sound.", "task: Set an alarm for 7:00 am on Mondays, Tuesdays, Wednesdays, Thursdays, and Fridays, with a custom label and vibration enabled.", "Task: Set a recurring alarm for 7:00 am from Monday to Friday, with vibration enabled.", "Task: Set a recurring alarm for 7:00 am on Mondays, Tuesdays, Wednesdays, Thursdays, and Fridays with the alarm set to vibrate and the label set as \"F\".", "task: set a recurring alarm for 7:00 am from Monday to Friday and customize the alarm options", "task: set a daily alarm for 7:00 am on Mondays, Tuesdays, Wednesdays, Thursdays, and Fridays, with the vibrate option not enabled.", "Task: Set an alarm for 7:00 am on Monday, Tuesday, Wednesday, Thursday, and Friday with the default alarm sound and customization options.", null, "Task: Set a recurring alarm for 7:00 am on Monday, Tuesday, Wednesday, Thursday, and Friday and then cancel it.", "Task: Set an alarm for 7:00 am on Monday, Tuesday, Wednesday, Thursday, and Friday with customized options and labels.", null], "c4814a6207d0182dff9710e56ac693646b3324b789ee67584d011088e91cd1c4": [null, "task: create a new timer with the default sound and the option to add a new sound", null, "Task: Create a new timer with default settings, including the option to disable sound.", "task: Create a new timer, select the default Cesium sound, and uncheck the Argon sound for the smartphone alarm clock.", "Task: Create a new timer with the default sound selected, and then uncheck the option for the sound \"Barium\".", "Task: Set up a new timer with a default alarm sound option (Cesium) and choose BeeBeep Alarm sound configuration.", "Task: Set a new timer with a default sound and choose not to have the alarm sound.", "task: Create a new timer with a default sound setting and enable the buzzer alarm.", "task: Create a new timer with the default sound and uncheck the Carbon sound option.", "task: Set a new timer with the default sound \"Cesium\" and uncheck the checkbox for using the \"Cesium\" sound.", "Task: Set a new timer with a default sound option and uncheck the Fermium sound option.", "Task: Set a new timer with the default sound and uncheck the Hassium sound option.", null, null, null, "Task: Set a new timer with default sound and uncheck the option for helium sound.", "Task: Set a new timer with the default sound of Krypton in the smartphone alarm clock.", "task: Set up a new timer with default settings and select the sound option \"Neon\" for the alarm.", "task: create a new timer with the default sound option and select Neptunium as a sound for the smartphone alarm clock.", "Task: Create a new timer with the default sound selected and uncheck the Nobelium sound option for the smartphone alarm clock.", "Task: Set a new timer with the Osmium sound as the default for the smartphone alarm clock.", "task: Set up a new timer with the default sound and uncheck the \"Oxygen\" sound option.", "Task: Set a new timer with a default alarm sound and enable the Piezo Alarm option.", "Task: Set a new timer with the default sound option and do not select the platinum sound option.", "Task: Set a new alarm timer with the sound option \"Default (Cesium)\" and exclude the sound option \"Plutonium\".", "task: Set a new timer with a default sound option and enable the Rooster Alarm sound option.", "task: Set a new timer with a default sound and uncheck the \"Scandium\" sound option."], "f909564be197db0f7e5de120ffc5bdecd6a0dec748e1305ad874d86cb3a6dcb4": ["task: set an alarm for 9:00 am on Sunday and Saturday.", "Task: Set an alarm for 9:00 am on Sundays and Saturdays.", "Task: Set an alarm for 9:00 am on Mondays.", "task: set an alarm for 9:00 am on Sundays and Saturdays with the vibration and sound options enabled.", "task: set a recurring alarm for 9:00 am on Sundays and Saturdays with a label \"W\"", "Task: Set an alarm for 9:00 am on Sunday and Saturday with a customizable label and specify vibration options and sound effects.", "task: Set an alarm for 9:00 am on Sundays and Saturdays with a customizable label and the \"F\" vibration option.", "Task: Set an alarm for 9:00 am on Sundays.", "Task: Set an alarm to go off at 9:00 am on Sunday and Saturday with vibration disabled.", "task: Set an alarm for 9:00 am on Sunday and Saturday with the default Cesium sound effects.", null, "Task: The user is trying to cancel the alarm set for 9:00 am on Sundays and Saturdays.", "task: set an alarm for 9:00 am on Sundays and Saturdays.", null], "b21791a8bb89972e81e8b9d3e4ddf93de440716d1c87b9d042f40d346f48079c": [null, null, null, "task: start the stopwatch and set it to zero.", null, null, null, "task: set a stopwatch or timer", null], "f4f8a01c4da0c6a7814b8b426e7de3e913be221bbc8d3de95e0ccc2be9af9e48": [null, null, null, null, null, null, null, null]}, "gallery": {"a54edb4560e79ad038ec5120a09ec838b034edd416abba65385969613b18a95b": [null, "Task: Take a photo or record a video using the smartphone camera.", "Task: View the contents of all folders in the gallery.", "task: Manage app gallery, search folders, open camera, view folder content, or access more options for further actions.", "task: view and manage the content of a specific folder in the gallery.", "Task: View photos in folder 6 of the DCIM directory in the gallery app.", null], "1fe2495c877d5fb97b300a4b11940855c97f6c7ec5c0ec6e0305af52b0887714": [null, "task: take a photo or record a video using the camera app", "task: Take a photo or record a video using the camera app.", "task: take a photo using the camera app.", null], "f27215cd13aecb6d203d7bed4c753284d24de06edc57717b9b126076303b5fdc": ["Task: Sort the gallery photos by a specific criteria or order.", "task: filter media in the gallery app.", "Task: Customize the view type of smartphone apps in the gallery.", "Task: Show temporarily hidden apps in the smartphone's gallery.", "Task: View temporarily excluded apps in order to manage and customize smartphone apps and settings efficiently.", "task: create a new folder in the gallery to organize photos or videos.", "Task: Change the column count of the gallery app to customize the display settings.", "Task: Customize and manage app settings for the smartphone.", "task: view information about the smartphone apps and settings.", null], "bcdc8bc32ab330c072627acc28b712faa15abff6c965ca31c5db8d7ec7f3ccd3": [null, "task: Sort the gallery images or videos alphabetically by name.", "task: sort and filter gallery apps based on name, path, size, last modified, date taken, random, and custom order.", "task: Sort gallery images based on size in ascending or descending order.", "Task: Sort the gallery images based on name, path, size, date taken, random, or custom order.", "task: Sort gallery photos by date taken.", "Task: Sort the gallery apps by random order.", "task: Sort and filter gallery images/apps based on a custom order.", "task: Sort and filter gallery images in ascending order based on name/size/date/random order.", "task: Sort the gallery apps in ascending order based on name, path, size, last modified, date taken, random, or custom order.", "task: Sort and filter gallery images based on name, path, size, last modified, date taken, random, or custom order.", "task: Sort and filter apps in the gallery based on name, path, size, last modified, date taken, random, or custom order.", null], "f296892e0ae3270e7e5851ec7aa50dd071de98f2905930ac1676391c0f1f64dd": [null, "Task: Filter and select media files to exclude Images from display or export.", "task: filter out videos from the gallery to display or export only photos.", "task: Filter media files to exclude GIFs from being displayed or exported.", "task: Filter and select media files for display or export by unchecking RAW images.", "task: filter media files and exclude SVGs from display or export.", "Task: Filter and select portrait media files for display or export in the gallery.", "task: filter and select specific media files for display or export", "task: Filter and select media files to display or export on the gallery.", null], "7dff668a1a1b95194b239f49899f5b1b85768029e3f9067123d3277b3a8b9f3b": ["task: change the view type of the app gallery display to uncheck the grid option.", "Task: Change the view type of the app gallery display to a list format.", "Task: Change the view type and enable grouping of direct subfolders in the app gallery display settings.", "Task: Change the view type of the app gallery display settings.", "task: change the view type for the app gallery display settings.", null], "439da42741fa3e717568b85f7850d504c6e01288f51f6e8036e63fc0cf7da179": [null, "task: create a new folder in the gallery app with internal storage.", "task: create a new folder in the gallery app and set up alarms within the folder.", "task: create a new folder in the gallery app on an Android device.", "Task: Create a new folder for organizing audiobooks with 0 items.", "Task: Create a new folder in the DCIM directory and organize photos into it.", "Task: Create a new folder in the Documents section of the gallery app.", "task: Create a new folder and download 1 item in the gallery.", "task: Create a new folder for movies and add items to it.", "Task: Create a new folder in the gallery and add the music item to it.", "task: Create a new folder for organizing photos and enable notifications for that folder.", "Task: Create a new folder in the gallery and add pictures to it.", "task: create a new folder in the gallery.", "Task: Create a new folder in the gallery app.", null, "Task: Create a new folder for podcasts.", "task: create a new folder for organizing and managing ringtones in the gallery app.", "task: Create a new folder in the gallery and select an image to place in it.", "task: Create a new folder and select the image \"screen_2023-06-30_143638.png\" to be saved in the new folder.", null], "6919cfa097bb6dc5bcc70b3a04c75500aeb04e8db499b49ba0c033318894e3aa": [null, "task: create a new folder in the gallery and select the internal storage for apps.", "Task: Select storage location for apps and create a new folder.", null], "f4e3bb56b18f61edcbc485302f7614a0c5ba2e590c7ce1e15e06c3272314ca1e": [null, "task: Create a new folder in the Internal storage and select the SD Card to manage folders and files.", null, "task: create a new folder in the internal storage and select an Android file within it.", null, "Task: Creating a new folder in the \"Internal\" storage and checking the availability of an SD Card in the DCIM folder.", null, "task: create a new folder in the internal storage and download 0 items from it.", "task: Create a new folder in the gallery and move files to the folder.", null, "Task: Create a new folder in the internal storage and select the option to store music files in it.", null, null, null, null, null, null, null, null], "35eaf64d1ecc1be38d8ba6b606c51c8f981caee6862065502be6803f57796b58": [null, "task: Create a new folder in the gallery and select the storage option for the folder.", "task: Create a new folder in the gallery and select the internal storage option instead of the SD card.", null], "62201a86c54e8da86647b398f58a99a0615b95e99ce263caf628d12b35799c48": [null, null, null, null, null, null], "3d2fb79219ed38df93493d5435d95ee98f91059cb992b203b17bb80fe3ee03e0": ["Task: Adjust the column count for the app gallery display.", "Task: Change the number of columns in the app gallery display.", "Task: Change the number of columns for the app gallery display to 3.", "Task: Change the number of columns for the app gallery display to 4.", "task: Change the number of columns for the app gallery display to 5.", "task: Set the number of columns for the app gallery display to 6.", "Task: Configure the number of columns for displaying the app gallery.", "Task: Change the number of columns for the app gallery display to 8.", "task: Set the number of columns for the app gallery display to 9.", "Task: Change the number of columns for the app gallery display to 10.", "Task: Change the number of columns for the app gallery display to 11.", "Task: Change the column count display of the app gallery to 12 columns.", "Task: Adjusting the number of columns in the app gallery display to 13.", "Task: Change the number of columns for the app gallery display to 14.", "Task: Change the number of columns for the app gallery display to 15.", null, "Task: Adjust the column count for the app gallery display to show 16 columns.", "Task: Change the number of columns for the app gallery display to 17.", "Task: Set the number of columns for the app gallery display to 18.", "Task: Adjust the number of columns for the app gallery display to 19.", "Task: Change the number of columns for the app gallery display to 20."], "e7268484b7258b11ad6f5dfc4e72131530628ba054524cfd6de55d3ada46c06d": [null, null, "task: customize the colors of the app interface.", null, "Task: Change the date and time format in the app's settings.", "task: adjust file loading priority and speed settings in the gallery app.", "Task: Add a folder or remove a folder from the list of included folders.", "Task: Exclude certain folders from being displayed in the gallery.", "task: Show hidden items in the gallery.", "Task: Change the settings to search all files instead of just folders for the gallery app.", null, "task: disable autoplay for videos in the app.", null, "task: enable or disable the \"Remember last video playback position\" feature in the app settings.", "Task: Enable loop playback for videos in the gallery app.", "Task: Configure video playback settings and enable videos to open on a separate screen with a new tab.", "Task: Disable the option to control video volume and brightness with gestures.", null, "Task: Disable cropping of thumbnails into squares in the gallery app settings.", "task: Change the thumbnail style for files in the gallery.", "task: customize the folder thumbnail style to be square in the gallery app.", null, "Task: Enable horizontal scrolling for the thumbnails in the gallery app.", "task: Disable pull-to-refresh function in gallery app settings.", null, "task: adjusting the app settings to enable maximum brightness when viewing fullscreen media.", "task: Enable black background for fullscreen media playback in the gallery app.", "task: enable the option to automatically hide system UI when viewing fullscreen media in the gallery app.", "task: enable/disable instant media change by clicking on screen.", "Task: Adjust the settings to enable the option for controlling photo brightness with a vertical gesture.", "task: Disable the option to close the fullscreen view with a down gesture.", "task: Disable notch display in the app's settings.", "Task: Adjust the system setting for rotating fullscreen media in the gallery app.", null, "task: disable deep zooming for images in the gallery app.", "Task: Disable the option to rotate images with gestures in the gallery app settings.", "Task: Change the settings to display images in the highest quality.", "Task: Enable 1:1 zooming in with two double taps in the gallery app.", null, "Task: Customize media playback settings and enable extended details for fullscreen media.", null, "task: Enable password protection for the entire application.", "Task: Enable password protection for hidden items in the gallery.", "task: Enable password protection for file deletion and moving in the gallery app settings.", null, "task: enable the option to delete empty folders automatically after deleting their contents.", "Task: Disable the option to keep old last-modified value during file operations.", "task: Disable delete confirmation dialog for gallery.", null, "Task: Disable the display of some action buttons at the bottom of the screen in the app's settings.", "task: Customize the visible bottom actions in the app settings.", null, "Task: Change the file management option to move items to the Recycle Bin instead of deleting them.", "task: Hide the Recycle Bin from the folders screen in the gallery app settings.", "Task: Customize the app settings to show the Recycle Bin as the last item on the main page.", "task: Empty the recycle bin and free up storage space.", null, "Task: Clear the app cache to free up storage space on the device.", "task: Export favorite images from the gallery.", "Task: Import favorites from another device or source into the gallery app's settings.", "Task: Export app settings for customization and migration options.", "task: Import settings from another device or backup."], "06d12a81a984d165f6107d52300085d901815170a2c6546fc7129a5ff30b88da": [null, "Task: Change the color theme of the gallery app to dark.", "Task: Change the text color for certain elements in the app's interface.", "Task: Customize the background color of the gallery app's interface.", "Task: Change the primary color of the app's interface.", "Task: Change the app icon color in the gallery app's settings.", null], "db8da4c4aed69c1ee76c3c58386edc9a9b8924ab9d096893dc87ae36659c73bb": [null, "task: customize the color theme of the gallery app to be dark.", null], "ee4bc85165d8e30eb0e6662bbd800d46bbbc7663b2262c79288c29040a6fb67d": ["Task: Customize the colors and theme of the app interface, and disable the Auto light/dark feature.", "task: customize the app interface by selecting a dark theme and unchecking the light theme option.", "Task: Change the app interface theme to a light color.", "Task: Customize the color theme of the app interface to \"Dark\" with the \"Dark red\" checkbox unchecked.", "Task: Change the app interface theme to the \"Dark\" theme and uncheck the \"White\" color option.", "Task: Change the app interface theme to Dark and customize colors, with the preference of having Black & White.", "task: customize the colors and select the Dark theme for the gallery app interface.", null], "e4a794e809bcf58fa0ca0ed45cf1a92b7b212cb82db7d3a70e21a63c34749186": ["Task: Adjust the file loading priority settings to remove the speed filter in order to display apps in the app gallery.", "Task: Adjust the file loading priority and speed settings for displaying apps in the gallery.", "Task: Adjust the file loading priority speed settings and select the option to avoid showing invalid files in the app gallery.", null], "a0054e64f7fd8323b726966d1b4fdb1fdd5f8a2a5f9bc0325952e490f2b3da79": [null, "task: add a new folder to the app gallery.", null, null], "b1c3c890e54515a04e321d35af0328cdce2b22c11f5375faf000c082bdb1416f": [null, null, null, null, null, null, null, null, null, "task: Customize the app settings and preferences for file management and media viewing.", null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, "Task: Manage and customize the included folders for file management and media viewing.", null, null, null, null, null], "075474cc3814f2330ca5c0f164517189e565440073b31fd926ac36e22e3d8cc7": [null, null, null, null], "0dfc17195a1ba68a96bc502389e3627b0981e51a59f5fcf4c6f20058633516fb": ["Task: Adjust the thumbnail spacing in the smartphone app gallery for customization purposes.", "Task: Customize the thumbnail style of files in the gallery app to have rounded corners.", "task: customize the file thumbnail style and enable/disable the animation of GIFs in the smartphone app gallery.", "task: change the file thumbnail style and show video durations in the smartphone app gallery.", "Task: Change the file thumbnail style and hide the display of image file types in the gallery app settings.", "task: change the file thumbnail style in the settings of the smartphone app gallery.", "task: Change the file thumbnail style in the settings of the smartphone app gallery.", "Task: Customize the file thumbnail style for the smartphone app gallery.", null], "f48966ab2fd7d96f8892f62c2b8040354b716ab44818e9b60cd5d91e9545de1e": [null, "task: toggle the visibility of filenames in the app gallery.", "task: Sort images/videos in the app gallery by a specific criteria.", null, null], "c4867c874a83f1245254d117e2f3761349f3beeeedd4fb03c66f737ccafa242a": [null, "task: View and organize photos in the DCIM folder and toggle filename visibility in the gallery app.", "Task: Sort the images in the gallery by a specific criteria (such as date, size, or name).", null, null], "827a24e214c3d5fda9cba05c5e5bc5c9d0e6d3e81a093a080e8cc952e01740c9": [null, "Task: Toggle visibility of filenames in the gallery's folder view.", "task: view all folders and their contents in the gallery.", null, "task: view all the files and folders from yesterday.", null], "5671bd90bd97eca48538d0127d0ed1c838f79ec595814f95d2db8dddb827ebab": [null, null, null, null, null, "Task: View the content of all folders, toggle the visibility of filenames, and open a specific image file for viewing.", "task: view the content of all folders, toggle the visibility of filenames, and open a specific image file.", "task: view the content of a specific folder", "Task: Toggle visibility of filename for a specific image (pic2.jpg).", "task: View the content of a specific folder and play a video file named \"video1.mp4\".", "task: View the content of all folders, toggle the visibility of filenames, and play the video \"video2.mp4\" in the gallery.", "task: View the contents of a specific folder and toggle the visibility of filenames before selecting and playing video3.mp4", "Task: View the content of a specific folder and toggle the visibility of filenames before selecting and viewing the image \"pic3.jpg\".", null]}, "dialer": {"36d9d3b201880926045a3f8ce61c43793956327bde63025e6ebeb56aacd079e4": [null, "task: sort phone contacts", "task: filter phone contacts based on specific criteria", "Task: Create a new contact.", "Task: Accessing the dialpad to make a phone call", "Task: Create a new contact for Alice.", "Task: Create a new contact named Bob.", "Task: Create a new contact named Jack.", "Task: Create a new contact and then dial a phone number", "task: make a phone call.", null, "Task: Add a new contact to the favorites list.", "task: view call history", null], "b1a00fd39b48c98523831f52dca1e27884000b421faf80ee89f5ecac04481894": [null, "Task: Sort contacts by first name in the dialer app.", "Task: Sort contacts by middle name and display them in the desired order preference.", "Task: Sort and display contacts by surname in ascending or descending order.", "Task: Change the sorting order of contacts by unchecking the \"Full name\" criterion.", "Task: Sort and display contacts by date created in ascending or descending order.", "Task: Change the sorting order of contacts from ascending to descending.", "Task: Sort contacts in descending order based on specific criteria, such as name, date added, or phone number.", "Task: Sort and display contacts by different criteria and order preferences, and then cancel the sorting operation.", "Task: Sort and display contacts by different criteria and order preferences.", null], "5d41ba4ba4a32d9fb05ea4b994f56fbf3f8e3cd2f82b62049581a8e736e91938": ["task: Change the visibility settings of phone storage for apps", "task: configure phone storage visibility settings and then cancel the operation.", "task: configure phone storage visibility and confirm the changes.", null], "77583b11ad5633cfffda3a1c606f2b82cf5edbe5739d839f74bfd29973528d44": ["task: customize the app's settings and access general information about the app.", "Task: Access app settings and obtain information about the dialer app.", null], "b6bf6a602f0f077f9d35ec740ca71a92dac5e0c34e6c4b74e58bec149547eef3": [null, null, "Task: Customize the colors and settings of the smartphone app dialer.", null, "task: unblock a previously blocked number", "task: change the date and time format settings in the smartphone app dialer.", "task: customize speed dial options in the smartphone app dialer settings.", "Task: Change the font size to \"Large\" in the smartphone app dialer settings.", "task: modify the startup preference to start the name with the surname in the dialer settings.", "task: customize dialer settings by hiding dialpad numbers", "task: Disable vibrations on dialpad button clicks in the smartphone app dialer settings.", "task: disable the beeping sound when pressing the dialpad buttons.", null, null, "task: customize the tabs shown in the smartphone app dialer.", "task: Set the dialer app to open the last used tab at startup.", "Task: Customize the app's settings to open the dialpad by default when the app opens.", null, "Task: Disable the feature that groups subsequent calls with the same number in the smartphone app dialer settings.", "task: enable a call confirmation dialog before initiating a call in the smartphone app dialer settings.", "Task: Adjust settings to disable the proximity sensor during calls.", "task: change the setting to respond to incoming calls with a swipe instead of a button press.", "task: customize the dialer settings to always display incoming calls on full screen."], "06d12a81a984d165f6107d52300085d901815170a2c6546fc7129a5ff30b88da": [null, "Task: Customize the color and theme of the dialer interface to a dark theme.", "task: Change the text color of the smartphone app dialer interface.", "task: Change the background color of the smartphone app dialer interface.", "task: Change the primary color of the smartphone app dialer interface.", "Task: Change the app icon color for the smartphone app dialer interface.", null], "db8da4c4aed69c1ee76c3c58386edc9a9b8924ab9d096893dc87ae36659c73bb": [null, "task: customize the colors and theme of the dialer app to dark mode.", null], "ee4bc85165d8e30eb0e6662bbd800d46bbbc7663b2262c79288c29040a6fb67d": ["task: change the app interface theme to Dark and disable the Auto light/dark feature.", "Task: Change the interface theme of the dialer app to a dark theme.", "task: change the app interface theme from dark to light.", "Task: Customize the color theme of the dialer app to a dark red interface.", "task: Change the app interface theme to the Dark theme and uncheck the checkbox for the White color.", "task: Customize the colors and theme of the dialer app to a dark theme and enable the black & white color scheme.", "task: Change the app interface theme to a custom dark color on the dialer app.", null], "38f20a5a0962efc75d9613829202b95fe5ef87cfa5fa89065feee5702f3b670a": [null, "Task: Add a number to the blocked list for call blocking on the smartphone app dialer.", null, "Task: Block calls from numbers that are not saved in contacts on the smartphone app dialer.", null, "task: Add a number to the list of blocked numbers for call blocking on the smartphone app dialer.", null], "8cb53267caec91fabbc33f0d955e0bf2bf6cc77828de61266c59a8cd30a73e28": [null, null, "task: add a number to the list of blocked numbers", "task: add a number to the blocked list to prevent calls and messages from that number.", null], "79ce56cc2b386505c9ed8324558fd8c9ca8fee60fc8ad3d62bb3c59b081f7731": [null, "task: Set the dialer app as the default caller ID and spam app on the smartphone.", "task: Set the dialer as the default caller ID and spam app, and enable blocking calls from contacts that are not stored.", "Task: Set up the dialer app to block calls from contacts that are not stored in the user's phone.", "task: Block calls from not stored contacts and set Dialer as default caller ID and spam app.", null], "e521940b04cc341765eac82253ed8f43e5161313a96e56f65c123833a814fcd2": [null, null, "task: Block calls from unknown numbers on the dialer.", null, null, null], "e4bc83f77703f52d07cd5f9ca5fb500d16741aefd16d4f6f35002bd13525c940": ["task: change the date and time format on the smartphone app.", "Task: Change the date and time format on the smartphone.", "Task: Change the date and time format on the smartphone to display as \"02/16/2021\".", "Task: Change the date and time format to display as \"16-02-2021\" on the smartphone's dialer application.", "Task: Change the date and time format to display as \"02-16-2021\" on the smartphone app.", "task: change the date and time format to \"2021-02-16\" in the smartphone's settings.", "task: Change the date and time format to 16 February 2021.", "Task: Change the date and time format in the smartphone's settings to display it as \"February 16, 2021\".", "Task: Change the date and time format to a 24-hour format in the smartphone's settings.", "task: change the date and time format and then cancel the changes.", "task: Change the date and time format in the settings of the dialer app.", null], "605651ace5ef6b2bbf205f73985e66b218ff175c27c27dbe0bc41a7f55eaa08a": [null, null, "task: add or edit a contact to the speed dial list.", "task: edit or modify the speed dial contact with the number 2.", "Task: Add a new contact to the speed dial on the smartphone's dialer interface.", "task: edit or update the contact assigned to speed dial slot number 4", "task: edit speed dial contact number 5 in the smartphone's dialer interface.", "task: assign speed dial number 6 to a specific contact.", "task: Edit or remove the speed dial contact assigned to the number 7.", "task: edit the contact assigned to speed dial number 8.", "task: set a speed dial contact for the number 9.", null], "0c705b9a74f692e6c4feab6b9d9f9b1b992876e5272ee28d4c03a00597b4ae41": ["task: customize the font size for the dialer and return to the previous screen.", "Task: Increase the font size in the dialer app and return to the previous screen.", "Task: Adjust the font size on the dialer app to be smaller.", "task: adjust the font size of the dialer to be larger", null], "acf9620fcbecde1976e6768be87d9f561d9e1c7eefbad7fba1a665735cff0e09": ["Task: Customize the tabs shown in the smartphone app dialer interface and remove Contacts tab from being displayed.", "Task: Customize the tabs shown in the smartphone app dialer interface by removing the \"Favorites\" tab.", "Task: Hide the call history tab from appearing in the smartphone app dialer interface.", "Task: Customize the tabs displayed in the smartphone app dialer interface.", "task: Customize the tabs shown in the smartphone app dialer interface.", null], "ccc9d9093adc8eee90eaa7f9081089d8c62c45aed859c6d1e3074fcb25a24071": ["task: modify contact information and set a new photo for a contact.", "Task: Create a new contact and mark it as a favorite.", null, null, null, "Task: Create a new contact in the dialer with mobile phone number and modify their contact information.", null, "Task: Create a new contact and then return to the homepage after modifying contact information, setting photo, favorites, phone numbers, email, address, birthday, notes, and groups.", null, "Task: Create a new contact and modify its information, including setting photo, favorite, phone numbers, email, address, birthday, notes, and groups.", "Task: Create a new contact with birthday information.", "Task: Create a new contact and save their contact information, including photo, favorite status, phone numbers, email, address, birthday, notes, and groups.", null, null, null, "Task: Create a new contact and add it to a group with no existing groups.", "Task: Create a new contact and modify contact information such as setting photo, favorite, phone numbers, email, address, birthday, notes, and groups."], "b497131bb37d355259223709b95c716efd4d28b0b2c5b00787c7eef44d8e896e": ["task: edit or update a contact's phone number label in the dialer app.", "task: add a new mobile phone number label for a contact's home number in the dialer.", "Task: Add a new contact with a mobile phone number and label it as \"Work\".", "task: create a new contact in the mobile dialer and select phone number labels for dialing.", "Task: Create a new contact with a mobile phone number and mark it as a work contact with fax capability.", "task: create a new contact with a mobile number and specify that it should not have a home fax number.", "task: Create a new mobile contact and specify if it includes a pager number.", "task: add a new contact to the smartphone's address book.", "task: create a new contact with a mobile phone number and select custom settings.", null], "bcc5460a524636adcd43bafd581c027dc236295050dd625e2ed4b0b742d543ac": ["task: create a new contact, go back to the home page, and remove the \"Home\" label from the checkbox.", "task: create a new contact for work", "Task: Create a new contact on the mobile phone and go back to the homepage.", "Task: Create a new contact with a phone number label and navigate back to the previous page.", "task: Create a new contact with a custom phone number label.", null], "22722d2dee1335c5482c1049aa7a6dbd5e481466f1ef8b3fa3a91a34b24b329d": ["Task: Schedule a reminder for an event in 2023.", "Task: Schedule a reminder or event on Saturday, July 1st.", "task: schedule a reminder for July 1st, 2023.", "task: create a new contact with a reminder for July 2, 2023.", "task: schedule a reminder or event for July 3, 2023.", "task: Schedule a reminder for July 4th, 2023.", "Task: Set a reminder for a new contact on 05 July 2023.", "task: create a new contact with a reminder for July 6, 2023.", "task: Schedule a reminder for an event on 07 July 2023.", "task: schedule a reminder for July 8, 2023", "task: schedule a reminder or event for July 9, 2023.", "task: create a new contact and schedule a reminder for 10th July 2023.", "Task: Schedule a reminder for July 11, 2023.", "Task: Set a reminder on July 12, 2023.", "task: schedule a new reminder for a contact on 13th July 2023", "Task: Create a new contact and set a reminder for July 14, 2023.", "task: create a new contact and set a reminder for July 15, 2023.", "task: create a new contact with a reminder on 16th July 2023.", "Task: Schedule a reminder or event for July 17th, 2023.", "task: schedule a reminder for a new contact on 18 July 2023.", "task: schedule a reminder on 19th July 2023.", "Task: Schedule a reminder for July 20th, 2023.", "Task: Schedule a reminder for July 21, 2023.", "task: schedule a reminder for July 22, 2023.", "task: create a new contact and set a specific date (23 July 2023)", "task: schedule a reminder for an event on 24th July 2023.", "Task: Schedule a reminder for an event on 25 July 2023.", "Task: Set a reminder or event on July 26, 2023.", "task: schedule a reminder for a new contact on July 27, 2023.", "Task: Set a reminder for an event on 28th July 2023.", "task: create a new contact and set a reminder for July 29, 2023.", "Task: Create a new contact with a scheduled reminder for 30 July 2023.", "Task: Schedule a reminder or event for July 31, 2023.", "Task: Schedule a reminder or event in the previous month.", "task: schedule a reminder for an event in the next month.", "Task: Create a new contact and set a date or time for scheduling or reminders.", "Task: Create a new contact and set a reminder or schedule for it.", "Task: Create a new contact and set a date or time for scheduling or reminders.", null], "1d44133c96356351315b0e4a555dec2dde8933d6120a3e2dd793c7d97a7f814b": ["Task: Add a new contact with birthday and anniversary information.", "task: create a new contact with a birthday event and remove the birthday event from the contact.", "task: Create a new contact with a birthday event and select \"Other\" as the type of event.", null], "aa42d6d7b1951400500e8c45aa29d226bcb19ef5818ba59d3557c3199a3c4c1f": ["task: create a new contact and add it to a new group in the smartphone's dialer app.", "task: create a new contact, add it to a group, and then cancel the operation.", "task: create a new contact and add it to a group called \"No groups\" in the dialer app.", null], "71ad59c500ac9c66a089da0d2c9694928a6d73f57a5b16001b88eedd88f87a68": ["task: create a new contact and save it to the phone storage as a hidden contact.", null], "c4f2f694d4393ad28929563eab36ffcb82111106f8d4dd5e224b6efd8e344bfe": ["Task: Customize the fields shown for contact information in the dialer app.", null], "b5c29ed0558462bb184cac18e589a6420d6aad11aaf9eab71ca82351e0d5f409": ["task: customize the display preferences for contact information fields in the smartphone app dialer.", "Task: Customize the display preferences for contact information fields in the smartphone app dialer by unchecking the \"First name\" field.", "Task: Customize the display preferences for contact information fields in the smartphone app dialer by adding the middle name field.", "Task: Customize the displayed contact fields in the smartphone app dialer by unchecking the \"Surname\" field.", "task: customize the display preferences for contact information fields in the smartphone app dialer", "task: customize the display preferences for contact information fields in the smartphone app dialer.", "task: customize the display preferences for contact information fields in the smartphone app dialer", "Task: Customize the displayed contact fields in the smartphone app dialer by unchecking the \"Emails\" option.", "task: customize the display preferences for contact information fields in the smartphone app dialer.", "task: enable instant messaging field to be displayed for new contacts in the smartphone dialer app.", "Task: Customize the displayed contact fields in the smartphone app dialer to exclude events like birthdays and anniversaries.", "Task: Customize the display preferences for contact information fields in the smartphone app dialer by unchecking the \"Notes\" field.", "Task: Customize the display preferences for contact information fields in the smartphone app dialer, specifically the ringtone option.", "task: customize the display preferences for contact information fields in the smartphone app dialer.", "Task: Customize the display preferences for contact information fields in the smartphone app dialer.", null, "task: customize the display preferences for contact information fields in the smartphone app dialer.", "Task: Customize the display preferences for contact information fields in the smartphone app dialer by adding websites as a shown contact field.", "task: Customize the display preferences for contact information fields in the smartphone app dialer by unchecking the \"Groups\" field.", "task: customize the displayed contact fields in the smartphone app dialer."], "0ca12ca4f59bd6e046754ae02e4ab0247b43b7af73a1d6d6f2d25684436f347c": ["task: add a new contact and change the photo/ picture for the contact.", "Task: Add a new contact and update the contact's photo by capturing or selecting a new photo.", null], "4a494442ef7fe79bad63d60f6260344632e313aeebf760de959e5860f9d4efb6": ["task: create a new contact and change the photo, then access the camera options", "task: add a new contact and change its photo by taking a picture.", null], "943039d6c25fab634c24e9f36528741c4670d06236924f560f1d4ea793278930": [null, "Task: Add a new contact and select a photo from the gallery for the contact's profile picture.", "Task: Change the photo of a new contact by selecting a photo from the file manager.", "Task: Add a new contact and set a photo for the contact.", "Task: Add a new contact and change the photo for the contact.", "Task: Add a new contact and change their photo.", null], "e131e93f5e9876af5d1d17d63a70b5a135f1dfc93972683f1af1eef3a7388748": [null, "Task: Mark Alice as a favorite contact.", "Task: Send an email to Alice.", "Task: Call contact Alice.", "Task: Send an SMS to Alice.", null, "Task: Call or communicate with Alice using the phone number 111111.", "Task: Call or email Alice from the contacts list.", "task: edit, share, or delete contacts related to Alice.", "Task: Edit the contact information and details of the contact named Alice.", "Task: Share Alice's contact information with someone.", "Task: delete the contact \"Alice\".", null, null], "bff4c730f9564da1281b8032849fbe1488161baa6216fe3721b8fa4b25b8b4af": [null, null, "task: send an email to Alice", "task: send an email to Alice", null], "467d921c37c70b9fd0d0f21ea8b93c3025ef4d0984d7aab6e67e6c940756c3e0": ["Task: Make a phone call to Alice and turn off the microphone during the call.", "task: make a phone call to Alice with the speaker turned off.", "task: Make a phone call to Alice and display the dialpad.", "task: Put a call on hold during a conversation with Alice.", "Task: Initiate a phone call to contact named Alice and add another call to the ongoing conversation.", "task: call Alice and end the call.", null, null, null, null], "428b067bee33b9f544af41f20f7740ca0d7109904f4b61cd79e50d5ea90d1f20": [null, null, "task: dial a number or send a SMS to Alice", "task: send an SMS message to a contact named Alice and add a new contact.", null, "task: send an SMS to Alice at 30.06, 12:18 PM.", "task: send an SMS message to Alice saying \"Hello\".", "task: sending an SMS with an attachment to Alice.", null, null], "03b40b6d114743d46681fa77f4a0a480dae509a2bfea2318de6a1cd4e78d586f": ["Task: Change the photo of contact Alice.", null, null, null, null, "task: edit the mobile phone number for the contact named Alice.", null, "Task: Edit contact details and options for the contact named 'Alice'.", null, "Task: Edit contact details and options for the contact named \"Unknown\".", "task: edit the birthday of contact Alice.", "task: edit contact details and save changes to contact \"Alice\".", null, null, null, null, null, "Task: Edit contact details and options for the contact named Alice.", null], "bfab4bf7c2c7b54f18f22d052fbdf2b69462dabb826993d560228c72a672c27b": [null, "Task: Confirm deletion of contact \"Alice\" and cancel the deletion process.", "task: delete a contact named Alice", null], "8fcf44ade1880e68dc7af01f764ae99507e0fc4966a991ed70e79814a74b6a08": [null, "task: Add Bob to favorites.", "task: send an email to contact Bob", "task: make a call to contact Bob", "task: send an SMS to contact Bob", null, "task: call/contact Bob using the mobile number 222222.", "task: send a message or email to the contact Bob.", "Task: Access and manage the communication options and contact details for the specific contact named Bob in the phone storage.", "Task: Edit the contact information of Bob.", "Task: Share contact details of Bob through a smartphone app.", "task: delete a contact named Bob", null, null], "6063090f9aeda054081d0a358367aef074b4dfa81b5302e57e4856653362fae8": [null, "task: the user wants to toggle the favorite status of the contact named Jack.", "task: Send an email to Jack.", "task: call the contact Jack.", "task: send an SMS to Jack", null, "task: Call Jack at 333333 on the user's mobile phone.", "task: Call Jack", "Task: Edit contact information for Jack.", "task: edit contact Jack.", "task: share Jack's contact information.", "task: delete a contact named Jack.", null, null], "bd98a979a8e6635be1fc598aef8736fbe62fa64affa9ffacfb32a7189e3f9805": [null, "task: Add a number to the user's contacts.", null, null, null, null, "Task: Make a phone call by entering the number \"1\" on the dial pad.", "task: Dial a phone number that contains the digit \"2\" and add it to the contacts.", "Task: Make a phone call or add a number with the digit '3' to contacts.", "Task: Dial a phone number or add the number to contacts starting with the digit 4 (e.g., 4-GHI).", "task: dial the phone number 5 or add the number 5 to contacts with the associated letters JKL.", "task: dialing a phone number that contains the digit 6 and any additional actions related to the phone call (e.g., adding the number to contacts).", "Task: The user is trying to dial a phone number that includes the digit '7'.", "Task: Make a phone call to a contact or add a phone number to the contact list.", "task: make a phone call to a number that contains the digits 9, W, X, Y, and Z.", "task: dial a phone number containing the asterisk symbol.", "Task: Make a call or add a number to contacts.", "task: Make a call or add a number with a hashtag to the contacts.", "task: Make a phone call to a specific number entered on the dial pad.", null], "52a5299065b902fc4c15bdb017cc11e6f7016b4f196812630def508dd44cf179": [null, null, null, null, null, null, "Task: Add contacts to favorites.", null, null, null], "c2f57686134356b605c0382b1627b8cb89c71e3597fe2bddae95f0f9c5a3c4e3": [null, null, "task: clear call history", null, "task: View call history and details for the call made by Alice at 11:26 AM for 08 seconds.", "task: View call history details for a specific call made/received from Bob on 30.06 for a duration of 00:02.", "task: view call history for Alice on June 30th.", null, "task: View recent call history and search for a specific contact in the contact list.", null, null, null], "97c26a5e72123f9600f56067580508f47038bc5f2f80df18adac5f6173536cf4": [null, "task: clear the call history.", "Task: Clear the call history on the dialer app.", null]}, "contacts": {"f89cc7584a3df5e0784713cb5191c2ef1607011f608b524d4625a88fb579f04b": [null, "task: sort the contacts by a specific criterion or order.", "Task: Filter contacts based on specific criteria such as name, phone number, email, or any other contact information.", "task: search for a specific contact or perform contact management functions such as sorting, filtering, creating, or viewing contact information.", "Task: View contact information for Alice.", "Task: View contact information and possibly edit or update contact details for Bob.", "Task: View Jack's contact information.", "Task: View the contact information for a contact named \"J\".", "task: create a new contact.", "Task: Make a phone call", null, "Task: Add a contact to the Favorites list.", "Task: Create a new contact group or manage existing contact groups.", null], "a967b4b00c494385f6b35449b1575c183f258ab736c946a12a3697c9c1f82ec0": [null, "Task: Modify group settings or create new groups.", "Task: Access information about a particular contact group.", null, null, "Task: Create a new group in the contacts app.", "task: create a new group in contacts.", null, "Task: Create a group in contacts.", null, null, null], "7e3352e3b885ef4bbfde43426dbdda6e6b967889e5eba218e0277b36d16d4cfd": [null, null, "Task: Create a new group in the contacts app but decide to cancel the process.", "Task: Create a new group in the contacts app.", null], "dbb320bd2730d31325f2b7e2ee763e7ed0c43004935c35f4bd50d84e5952fde7": [null, null, null, null, null, "Task: Add a contact to the favorites list.", "task: add a contact to favorites.", null, "Task: Add a contact to favorites.", null, null, null], "2eee36feaf49883f4089091008f95ae95271406fec37cb90f330f9e766bc3595": [null, null, null, null, "task: add a contact to favorites.", "task: add a contact to favorites", null], "519dcdd3d48aae92a24073b13b3e0d2704cfa3f644d023807b499013745623a0": ["Task: Import contacts from a .vcf file.", "Task: Export contacts as a .vcf file.", "Task: Adjust the settings for the contacts app.", "Task: Access information about the contacts app and its settings.", null], "6c15d08aec3a402a628f85b3d96898a6db9ec6b7d2e522ba14ac3fe2c8365d0f": ["task: Import large .vcf file of contacts into the smartphone.", "Task: Import contacts from a .vcf file saved in the file system, specifically for contacts created or modified this week.", null, "task: import contacts from a .vcf file saved in Google Drive.", "task: import contacts from a .vcf file into the smartphone's contacts directory.", null, "task: Import contacts from a .vcf file and view them in grid view format.", "task: import contacts from a .vcf file and navigate through the file system.", null, "task: import contacts from a .vcf file and search for a specific contact.", null, null, null], "8de486e14e68354b64c857f1099d349fc20b5d40f93ee564c303f524b4a80076": [null, null, null, "task: Export contacts from phone storage to a .vcf file and allow visibility to other apps.", "Task: Export contacts to a .vcf file.", "Task: Exporting contacts from the phone storage to a .vcf file.", null], "8b528df166c868ad9622db32da094e4f8ffa12ba1f3b3ccc8bd32315b24eeb06": [null, null, "Task: Personalize the color scheme for the Contacts app on the smartphone.", null, "Task: Adjust the font size to large in the Contacts app settings.", "task: customize the fields shown in the contacts app", "task: disable the automatic merging of duplicate contacts in the settings.", "Task: Enable call confirmation dialog before making phone calls in the Contacts app.", "task: Hide private contacts from being displayed in the Simple Dialer and Simple SMS apps.", null, "Task: Hide or display specific tabs or categories in the Contacts app.", "Task: Set the Contacts app to open the last used tab when the app starts.", null, "Task: Customize the settings and preferences for the Contacts app on the smartphone.", "Task: Remove the dialpad button from the main screen of the Contacts app.", "Task: Filter contacts to only show those with phone numbers.", null, "task: Disable contact thumbnails in the Contacts app settings.", "Task: Customize settings to show phone numbers in the Contacts app.", "task: Change the settings to start showing contact names with surnames."], "20b76127089899a84db48c80e26e6cfccc55dbad4cb655ec12d1a37300c1ffc9": ["task: import contacts from a .vcf file into a specific group", "task: Export contacts as a .vcf file.", null], "06d12a81a984d165f6107d52300085d901815170a2c6546fc7129a5ff30b88da": [null, "Task: Change the color theme of the app's contact interface to a dark theme.", "Task: Change the text color in the app's contact interface.", "task: change the background color of the app's contact interface.", "Task: Change the primary color of the app's contact interface.", "task: change the app icon color in the settings to customize the colors of the contact interface.", null], "db8da4c4aed69c1ee76c3c58386edc9a9b8924ab9d096893dc87ae36659c73bb": [null, "Task: Change the theme of the app to Dark mode.", null], "ee4bc85165d8e30eb0e6662bbd800d46bbbc7663b2262c79288c29040a6fb67d": ["task: customize the color theme and enable auto light/dark mode in display settings.", "task: Change the display settings to the dark theme and uncheck the \"Light\" option.", "task: change the display theme to dark mode", "task: customize the display colors and switch to dark mode with a dark red theme.", "Task: Customize the color theme of the smartphone app to a dark mode and uncheck the \"White\" option.", "task: customize the color theme to dark mode and enable the \"Black & White\" option.", "task: change the display settings to customize colors and select the Dark theme.", null], "0c705b9a74f692e6c4feab6b9d9f9b1b992876e5272ee28d4c03a00597b4ae41": ["Task: Adjust the font size preference to \"Large\" in the settings and navigate back to the previous page.", "Task: Adjust the font size to large and navigate back to the previous page.", "Task: Adjust the font size preference to be smaller in the smartphone settings.", "Task: Adjust font size preference to \"Extra large\" in the settings.", null], "b5c29ed0558462bb184cac18e589a6420d6aad11aaf9eab71ca82351e0d5f409": ["task: customize the contact details and preferences for the smartphone app by adding or modifying the contact's prefix.", "task: hide or remove the first name field from the contact details.", "task: add middle name field to contact details in smartphone app.", "Task: Customize contact details and preferences by hiding the surname field.", "task: add a suffix to the contact details and preferences for the smartphone app.", "task: customize contact details and preferences by adding a nickname to a contact.", "task: customize which contact fields are shown in the smartphone app.", "task: customize the contact information displayed on the smartphone app by unchecking the \"Emails\" field.", "Task: Customize the contact details and preferences by unchecking the option to show addresses.", "task: customize contact details and preferences by enabling instant messaging for contacts.", "task: Customize contact details and preferences by unchecking the option to display events (birthdays, anniversaries).", "task: remove the \"Notes\" field from the displayed contact information in the smartphone app.", "task: customize contact ringtone and manage shown contact fields in the smartphone app.", "task: customize which contact fields are shown in the app.", "task: customize which contact details are displayed and manage contact field preferences", null, "task: customize the contact details and preferences to display the organization information on the smartphone app.", "task: add a website to a contact's details in the smartphone app.", "task: customize which contact fields are shown in the app, by unchecking the \"Groups\" option.", "Task: Customize contact details and preferences by removing the contact source from being shown."], "9ee6d8231ca24f0fe019456840d8efebcd70fe045776f8a0890fe1740b484c4d": ["task: Hide or remove the Contacts tab from the homepage of the contacts app.", "Task: Remove favorites from the shown tabs in the contact list interface.", "task: remove the \"Groups\" tab from the contact lists.", "Task: Manage shown tabs by selecting, organizing, and customizing contact lists.", "task: customize the contact tabs shown on the homepage by selecting contacts, favorites, and groups.", null], "adf218f6ae1a884d943df51a00fa0627d0ae8788c75943e49ead925144ee7ab6": ["Task: Set the contacts tab to open the last used contact when the app starts.", "task: View last used contact, manage favorites, groups, and change the tab app opens at start.", "task: Set the tab to open at app start to the last used contact and check/uncheck the \"Groups\" option.", "task: change the settings to stop the app from opening at the last used contact on startup.", null], "e090cef73bf5816d395a110d051a4fb41fd33b544420b26b636f51b8da08f2e5": ["task: enable the option to view contact details upon clicking on a contact in the contacts list.", "task: disable the feature of viewing contact details when clicking on contacts.", "task: update the contact settings for contact click to view contact details", null], "ccc9d9093adc8eee90eaa7f9081089d8c62c45aed859c6d1e3074fcb25a24071": ["Task: Add a new contact and change the photo for the newly added contact.", "Task: Create a new contact and toggle their favorite status in the contacts list.", null, null, null, "task: create a new contact and specify that the contact belongs to the \"Mobile\" category.", null, "task: create a new contact", null, "task: create a new contact with unknown information.", "task: add a new contact with birthday information.", "task: create and save a new contact.", null, null, null, "task: Add a new contact and assign it to a specific group.", "task: create a new contact and save it to phone storage that is not visible to other apps."], "b497131bb37d355259223709b95c716efd4d28b0b2c5b00787c7eef44d8e896e": ["Task: Edit the label of an existing contact to remove the \"Mobile\" designation.", "task: create a new mobile contact with the label \"Home\".", "Task: Add a new contact with the label \"Mobile\" and \"Work\".", "Task: Create a new contact with the label \"Mobile\" for the main contact.", "Task: Create a new contact with a mobile number and assign it the label \"Work Fax\".", "Task: Create a new contact with a mobile number and select the label \"Home Fax\" for organizing the contact's phone numbers.", "Task: Create a new contact with a mobile phone number and an unchecked pager label.", "Task: Create a new contact and assign the label \"Mobile\" to it, with the option to include the \"Other\" label.", "Task: create a new contact with a custom label for a mobile phone number.", null], "bcc5460a524636adcd43bafd581c027dc236295050dd625e2ed4b0b742d543ac": ["Task: Edit or update the contact details for a contact named \"Home\".", "Task: Create a new contact for the \"Work\" category and navigate back to the homepage.", "Task: Create a new contact and specify that the contact's mobile number checkbox should be unchecked.", "task: create a new contact and categorize it under \"Other\" option.", "task: Create a new custom contact and navigate back to the homepage.", null], "22722d2dee1335c5482c1049aa7a6dbd5e481466f1ef8b3fa3a91a34b24b329d": ["task: create a new contact with the name \"Unknown\" and set the birthdate as 2023.", "Task: Create a new contact with the date of birth set to Saturday, July 1.", "task: create a new contact with the name \"Unknown\" and set the birthdate as July 1, 2023.", "task: create a new contact with the name \"Unknown\" and the birthday set on July 2, 2023.", "task: create a new contact with the birthdate set to July 3rd, 2023.", "task: create a new contact with the name \"Unknown\" and a birthday on July 4, 2023.", "task: create a new contact with a birthdate of July 5th, 2023.", "Task: Create a new contact with the name \"Unknown\" and set the birthdate to July 6, 2023.", "Task: Create a new contact with the name \"Unknown\" and set the birthdate as July 7, 2023.", "task: create a new contact with a birthday on July 8th, 2023.", "Task: Create a new contact with the name 'Unknown' with a birthdate set for July 9, 2023.", "Task: Create a new contact with a birthday on July 10, 2023.", "Task: Create a new contact with the name \"Unknown\" and the birth date as July 11, 2023.", "task: create a new contact with a birthdate of July 12th, 2023.", "task: create a new contact with the name \"Unknown\" and set the birthdate as 13 July 2023.", "Task: Add a new contact with a birthday on July 14, 2023.", "task: add a new contact with the name \"Unknown\" and the birthdate set to July 15, 2023.", "Task: Add a new contact with the name \"Unknown\" and set the birthdate as July 16, 2023.", "task: create a new contact with the name \"Unknown\" and the birthdate set to July 17", "task: create a new contact with the name \"Unknown\" and set the birthdate to July 18, 2023.", "task: create a new contact with the date of birth set to 19 July 2023.", "task: create a new contact with the name \"Unknown\" and set their birthday as July 20th without specifying the year.", "task: create a new contact with a birthday on July 21, 2023.", "Task: Add a new contact with the name \"Unknown\" and the birthdate set to \"July 22nd\".", "task: create a new contact with the name 'Unknown' and set their birthdate to 23 July 2023.", "Task: Create a new contact with a birthdate of 24 July 2023.", "Task: Add a new contact with a birth date of 25th July 2023.", "task: create a new contact with the birthday set as 26th July", "Task: Create a new contact with the name 'Unknown' and set the date of birth as 27th July 2023.", "task: create a new contact with a birthday on July 28, 2023.", "Task: Add a new contact with the name \"Unknown\" and set their birthday as July 29, 2023.", "Task: Create a new contact with the date of 30 July 2023.", "Task: Create a new contact with the name \"Unknown\" and set the birthdate as 31 July 2023.", "task: create a new contact and select a date from the previous month.", "Task: Create a new contact, update some unknown details, and schedule a follow-up for next month.", "task: create a new contact and hide the year of birth.", "task: create a new contact", "task: create a new contact with unknown information.", null], "1d44133c96356351315b0e4a555dec2dde8933d6120a3e2dd793c7d97a7f814b": ["Task: Add a new contact with a birthday and an unchecked anniversary.", "Task: Edit or update the birthday information for a new contact.", "Task: Create a new contact with a birthday and categorize it under \"Other\".", null], "0ca12ca4f59bd6e046754ae02e4ab0247b43b7af73a1d6d6f2d25684436f347c": ["task: create a new contact, and change the photo for that contact.", "Task: Create a new contact and change the photo for the contact.", null], "4a494442ef7fe79bad63d60f6260344632e313aeebf760de959e5860f9d4efb6": ["task: Create a new contact and change the photo for the contact profile.", "task: Add a new contact with a photo", null], "dbe4c78447ae062515b18647ed79838215a4ed7fe3576b535a639d5e5dbe0042": ["task: add a new contact and take a photo", "task: create a new contact with a photo", "task: Add a new contact with a photo, but then decides to cancel and not take a photo.", null], "f7b661f3f3a53b2d4831a6229a279f617dab5482fb9739aef48663e87371ebfe": [null, "task: create a new contact and change the photo to a taken picture, then finish editing the contact with basic editing options in the gallery.", "Task: Adding a new contact with a photo by taking a picture and selecting the photo afterwards.", "task: create a new contact and change the photo, take a new photo using the camera, and save the contact with the new photo.", "task: create a new contact and change the photo, by either taking a new photo or selecting an existing one.", null], "aa42d6d7b1951400500e8c45aa29d226bcb19ef5818ba59d3557c3199a3c4c1f": ["Task: Create a new contact group in the contacts app.", "Task: Cancel creating a new contact and go back to the contacts homepage.", "Task: Create a new contact and add them to a group in the contacts app.", null], "71ad59c500ac9c66a089da0d2c9694928a6d73f57a5b16001b88eedd88f87a68": ["Task: Create a new contact and make it visible in phone storage.", null], "c4f2f694d4393ad28929563eab36ffcb82111106f8d4dd5e224b6efd8e344bfe": ["Task: Customize the fields shown for a new contact in order to manage contact information.", null], "e131e93f5e9876af5d1d17d63a70b5a135f1dfc93972683f1af1eef3a7388748": [null, "Task: Add Alice as a favorite contact.", "Task: Send an email to the contact Alice.", "Task: Call contact Alice", "Task: Send an SMS to Alice.", null, "task: view contact information and call or message Alice on her mobile number 111111.", "The task the user is trying to finish: Send an email to Alice.", "Task: View and edit the contact information of Alice stored on the phone.", "task: edit contact information for Alice.", "task: share contact information of Alice with someone.", "Task: Delete contact Alice.", null, null], "03b40b6d114743d46681fa77f4a0a480dae509a2bfea2318de6a1cd4e78d586f": ["Task: Change the photo of the contact \"Alice\".", null, null, null, null, "Task: Edit Alice's mobile phone number in the contacts list.", null, "Task: Update or modify the contact information for Alice.", null, "Task: Edit the contact information for the contact named \"Unknown\".", "Task: Edit Alice's birthday in the contact information.", "Task: Update Alice's contact information and save the changes.", null, null, null, null, null, "Task: Edit contact Alice and assign her to a different group.", null], "467d921c37c70b9fd0d0f21ea8b93c3025ef4d0984d7aab6e67e6c940756c3e0": ["task: make a phone call to contact Alice with the microphone turned off.", "task: Make a phone call to Alice using the speakerphone and then turn off the speaker.", "Task: Call Alice using the dialpad.", "task: put a call with Alice on hold.", "Task: Add a call to Alice's contact.", "Task: Making a call to Alice and then ending the call.", null, null, null, null], "bfab4bf7c2c7b54f18f22d052fbdf2b69462dabb826993d560228c72a672c27b": [null, "task: delete the contact for Alice.", "Task: Delete contact Alice from the user's smartphone contacts.", null], "8fcf44ade1880e68dc7af01f764ae99507e0fc4966a991ed70e79814a74b6a08": [null, "task: favorite/unfavorite a contact named Bob.", "Task: Send an email to contact Bob.", "task: call contact Bob", "task: send an SMS to Bob", null, "task: edit the mobile number for contact Bob.", "task: view the contact details of Bob", "Task: View or access Bob's contact information on phone storage.", "task: edit contact information for Bob", "task: share contact information of Bob.", "task: delete the contact named Bob", null, null], "52e178c921ff9d93ab5665339017cf1d2b508ebfca1a68aff58ac3cb4d7c5db2": ["Task: Change the photo of the contact named Bob.", null, null, null, null, "Task: Edit the mobile phone number for the contact named Bob.", null, "Task: Edit the contact details of Bob.", null, "Task: Edit the contact details of the person with the name \"Unknown\".", "task: edit the birthday of the contact Bob.", "task: edit and save contact information for contact Bob.", null, null, null, null, null, "Task: Add Bob to a group.", null], "33261b024cf187d44cfbd77ea3cc0b387c9dc6a7ca8739e8c64c9449cb33976d": ["task: make a phone call to Bob with the microphone turned off.", "task: make a call to Bob with the speaker turned off.", "task: call Bob", "task: put a call with Bob on hold.", "task: make a new call to the contact \"Bob\".", "task: make a call to contact Bob and end the call.", null, null, null, null], "1cae07095b38daec40a4d1a5bc88a2cae60b174bae11023984db189c7506503a": [null, null, null, null, null], "e33d889be8cc45d985cf46d1e1f3a3f3be9e098aebbea7c73e49dd1cdc6c5cb1": [null, null, null, null, null, null, null, null, null, null], "0c6ecc168d278b6c47b1eed30c10b455056e5e0d4664c844fde18c4555c3aa90": ["Task: Create a new contact group and add Bob to it.", "Task: Create a new contact group for Bob on the smartphone app.", "Task: Create a contact group for the contact Bob.", "Task: Create a new contact group for Bob.", null], "6063090f9aeda054081d0a358367aef074b4dfa81b5302e57e4856653362fae8": [null, "task: mark Jack as a favorite contact.", "task: send an email to the contact named Jack.", "task: call Jack", "task: send an SMS to Jack.", null, "Task: Call Jack using the mobile number 333333.", "task: Sending an email to Jack", "task: View the phone storage for a specific contact, possibly to delete or move files.", "task: edit contact information for Jack.", "task: share contact information for Jack.", "task: delete the contact named Jack.", null, null], "bd98a979a8e6635be1fc598aef8736fbe62fa64affa9ffacfb32a7189e3f9805": [null, "Task: Add a new number to an existing contact in the user's phonebook.", null, null, null, null, "Task: Dial a phone number or initiate a call to a contact starting with the digit \"1\".", "Task: Dial a phone number using the dialpad, specifically inputting the number \"2\" with associated letters \"ABC\".", "Task: Dial a phone number containing the number '3' and the corresponding letters 'D', 'E', and 'F'.", "Task: Dial a phone number containing 4, G, H, or I from the dialpad in order to make a call.", "Task: Dial a specific contact whose name starts with the letter 'J' or 'K' or 'L' by using the dialpad.", "Task: Dial a number starting with the digit 6 (specifically, the MNO letters corresponding to the number 6 on a traditional dialpad).", "Task: The user is trying to enter the dialpad and input the number \"7\" to make a call.", "Task: Dial a phone number containing the digit \"8\" from the contacts using the dialpad.", "Task: Make a phone call by dialing the number '9' which corresponds to the letters 'WXYZ' on the dialpad.", "Task: Dial a phone number using the on-screen dialpad, including the use of an asterisk '*' character in the phone number.", "Task: Dialing a phone number starting with the digit \"0+\" from the contacts or making a call to a number starting with \"0+\".", "Task: Make a call using a phone number that includes a hashtag (e.g. dialing a conference call number).", "Task: Make a phone call by entering a specific number using the dialpad.", null]}, "firefox": {"8296582e793e9f504816578383d9d54e13b7fac650c9089e45589743940ebf27": ["task: Start browsing the internet using private mode for enhanced privacy and security.", null, "Task: Conduct a search using Google while browsing in private mode.", null, "task: switch to a different tab in the browser.", "Task: Access the menu options in Firefox browser.", null], "39180632bed6820472c6b99209b673b6fc599e7f661164ee753d0964854383bf": ["task: access and manage bookmarks", "task: check browsing history or revisit a previously visited webpage", "task: access or manage downloaded files and documents", "task: install or manage add-ons on their Firefox browser.", "task: sync and save data across different devices for Firefox.", "task: manage account and devices", "task: Enable desktop site view in Firefox browser", "Task: Access the \"What's new\" section in order to view information about the latest updates or changes in the Firefox app.", "task: accessing help and support resources", "task: customize the homepage on Firefox.", "task: adjust settings or preferences for the Firefox browser.", null], "7c090f40f597064832b6328c6a9714b8e9f0006bca4a73f1b0cb710570464e23": ["task: navigate back to the previous webpage or close the browser.", null, "task: search for a specific bookmark folder or search term within bookmarks.", "task: add a new folder to the bookmarks section.", "task: Close the browser.", "task: access and view desktop bookmarks", null], "104c27bf48e99d8da8bde6090a1edcaf7e476367e180b46f7edda9d42773388b": ["The task the user is trying to finish: View the history of visited web pages.", null, "task: Navigate to the history and search for specific terms in the search history.", "Task: Delete browsing history.", "task: view recently closed tabs", null, null], "83bfae0a61a87ae805d3df7ea7213bb7d4221ed3f5ef687909821dda60f924da": [null, null, "task: view the list of recently closed tabs and close one of them.", "task: Access the full browsing history and view recently closed tabs in Firefox.", null, null], "d2e60c5decfa833a162aebf7333ba672e85db064fa107a02b7c0b8ae9fb00c4c": ["task: Install or remove an add-on or extension on Firefox.", null, null, null, null], "80e74c20ca3cfc5fd7050f4dd97f8a288470467c68ceab6363d903d403fdff15": ["task: Sync and save data, sign in, pair with computer, create account or navigate.", null, null, null, "task: Sync and save data, possibly signing in and pairing with a computer.", "task: switch from using a sync account to using an email account for data syncing and saving.", "task: Create a new Firefox account to sync data across devices and pair with a computer.", null], "9586e9a07306129f3fc13eca8c84640f49bdc3dca12076a3217967cf476ed209": ["task: Access and manage account and device settings on the Firefox browser.", "task: Access site information for managing account and devices on Firefox.", "task: Access and manage account settings and devices on Firefox.", "task: switch to a different open tab.", "task: Accessing and managing account settings and devices", null], "69bfe8927dc1d83a03d6fb09c17a6762a4144d228526f8b1946eb05489afe52c": [null, null, null, "task: Manage and customize Firefox browser settings and account information on accounts.firefox.com.cn.", null, null, null], "17d6b2bb5b89a8227aa57f4aaa74dc54514beacf47a1765f3cb4307184c34ff0": [null, null, null, "task: Access and manage Firefox account settings, including Firefox Sync, tab switching, and webpage navigation.", null, "task: Access and manage Firefox account settings, including devices and Firefox Sync, and navigate between tabs and webpages.", "task: Access and manage Firefox account settings and devices.", "task: sign up or sign in to a Firefox account.", "task: Access and manage Firefox Sync settings and account information.", null, null, null, null, null, null], "21bf3b53883c2c81331e82edab397e6231bcf89a73dd5ae073bd30a819402b6b": [null, "task: navigate back to the home screen and dismiss any notifications.", null], "f3d7cb40b3b3071657693853ce8f663a37d89481d56fae1fd4076dab40a26f9c": [null, null, "task: view all recent tabs", "task: Access and manage the user's Firefox account and devices settings and information.", null, "task: View all past explorations or browsing history.", "task: Access account settings", "task: Manage Firefox Account and devices, possibly login or change account settings.", null, null, null, null, "task: Switch between tabs on the Firefox browser.", null, null], "acef8d4ff4cd6417a7a0cf630bd8753306c1fea49b523c5eb08be56957fb3e6e": ["task: access and modify browser settings, privacy and security, advanced features, and about information.", null, "Task: Enable sync and sign in to access browser data across multiple devices.", "task: enable or disable the use of domestic China services in the Firefox browser.", null, "task: Change the default search engine to Google in Firefox settings.", "task: Enable or disable the option to manually close tabs in the Firefox browser.", "task: Change the homepage settings to automatically open a specific website after four hours.", "task: customize browser settings and preferences", "task: manage logins and passwords in Firefox.", "task: enable or disable autofill feature in Firefox browser.", "task: adjust accessibility settings for the Firefox browser.", null, "task: change the language settings of the Firefox browser.", "task: Set Firefox as the default browser on their smartphone.", null, "task: Enable private browsing mode for increased privacy and security while browsing.", "task: Enable HTTPS-Only Mode for enhanced security and privacy in Firefox settings.", "task: Enable or modify the enhanced tracking protection feature in the Firefox browser.", "task: manage site permissions and customize browser settings", "task: delete browsing data and clear cache", "task: configure Firefox to delete browsing data every time the user quits the browser", "Task: Enable the option to delete browsing data when quitting Firefox.", "task: configure notification settings for the Firefox browser.", "task: adjust data collection settings for Firefox browser.", null, null, "task: change the setting to always open links in apps", "task: configure the external download manager settings for the Firefox browser.", "task: enable remote debugging on Firefox for USB connection to debug web pages on a connected device.", null, "task: rate the Firefox app on Google Play", "task: view information about Firefox, such as version number and update information."], "3710ff8a611a5b0a56c8e79993bad55cb24d289dd99aa9a3d8cc3420d70f7799": [null, null, null, "Task: Adjusting tab settings to manually close tabs in the Firefox app.", "task: Close tabs manually and switch to Grid view in Firefox settings.", null, "task: change the settings to always close tabs manually in the Firefox app.", "task: Changing Firefox settings to automatically close tabs after one day.", "task: scheduling a tab to close automatically after one week.", "Task: Adjust the settings for tab management in the Firefox app, including the option to automatically close tabs after one month.", null, "The task the user is trying to finish is to configure the settings to automatically close tabs that haven't been viewed for two weeks in the Firefox app.", null], "7a817b721d1abfd6c27bfde5f105932dcea6ae150b78ccd945861b17390b83b9": ["task: customize and manage settings, privacy, security, and advanced options for the Firefox app.", null, "task: Sign in to sync tabs, bookmarks, passwords, and more.", "task: Configure Firefox app to use domestic China service for enhanced browsing experience.", null, "Task: Change the default search engine to Google in the Firefox app.", "task: customize and manage the settings and preferences for the Firefox app.", "task: Set up the Firefox app to open the homepage automatically after a four-hour interval.", "task: customize and manage settings, privacy, security, and advanced options for the Firefox app", "task: manage login credentials and passwords for the Firefox app.", "task: customize and manage autofill settings for the Firefox app.", "task: adjust accessibility settings for the Firefox app", null, "task: change the language settings of the Firefox app.", "task: Set Firefox as the default browser on the smartphone.", null, "task: Enable private browsing on Firefox app.", "task: enable HTTPS-Only Mode in the Firefox app.", "Task: Enable or disable the Enhanced Tracking Protection feature in the Firefox app settings.", "task: Manage site permissions for the Firefox app.", "task: delete browsing data on the Firefox app.", "task: enable/delete the option to delete browsing data on quit in Firefox app.", "task: Customize and manage notification settings in the Firefox app.", "task: Manage data collection settings for the Firefox app.", null, null, "task: change the Firefox app settings to never open links in other apps.", "task: customize the settings of the external download manager in the Firefox app.", "task: enable remote debugging via USB for the Firefox app.", null, "task: rate the Firefox app on Google Play.", "task: check the current version of Firefox app."], "7ac99f8e17b8d9e13aa055ac0533f85e18a6ea7df2ef8ee29c53ffb5beb2f0d7": [null, null, "task: customize homepage settings and shortcuts on the Firefox browser.", "task: customize homepage and sponsored shortcuts settings on Firefox browser.", "task: Set the Firefox homepage to open automatically after four hours of inactivity.", "task: change homepage settings and view recent bookmarks", "task: Change homepage settings and view recently visited websites.", "Task: Customize the homepage settings and access thought-provoking articles powered by Pocket.", "task: change the settings for the homepage to display sponsored stories after four hours.", "task: Change the homepage settings and set it to open after four hours, then access the wallpapers section.", null, "task: Change the settings to set the homepage to open after four hours.", "task: Set the homepage to open automatically after four hours of inactivity.", "task: Set the homepage to automatically open after four hours of inactivity.", null], "75b4096ac559e61f8a19bd20f19660a789b1a32611dcba620406f7b6f472c123": [null, null, "task: Change the default homepage setting to \"Open on homepage after four hours\".", null, null, null, null, null, null, null], "111550fe29e239939d7015ce2189b06981f0b80efaddad581b0b25e2f806e330": [null, null, "task: check for updates and information about Firefox.", null, "task: check the version and build number of Firefox.", "task: check the version and details of the Firefox browser.", "task: find information about the new features and updates in Firefox.", "task: access support and information about Firefox features.", "task: check for any recent crashes in Firefox.", "task: Read and understand the privacy notice of Firefox.", "task: Familiarize themselves with Firefox's features, support, privacy notice, and licensing information.", "task: view the licensing information of Firefox.", null, "Task: Learn about the libraries that Firefox uses for its functionalities and features."], "a8750527c321a3ae405ea4e80bc1befaff23d480861e53e2833f5862631870e9": [null, null, "Task: Changing the language setting of Firefox on their smartphone.", "Task: Change the language settings in the Firefox app to follow the device language and set it to English (United States).", "Task: Change the language settings in the Firefox app to Albanian (Shqip).", "Task: Change the language settings in the Firefox app to Amharic.", "task: Change the language settings in the Firefox app to Arabic.", "task: change the language settings to Aragonese in the Firefox app.", "Task: Change the language settings of the Firefox app to Armenian (Armenia).", "Task: Change the language setting in the Firefox app to Asturianu (Asturian).", "task: change the language settings in the Firefox app to Azerbaijani (Azərbaycan).", "task: Change the language settings of the Firefox app to Balinese.", "task: change the language settings of the Firefox app to Bengali.", "task: change the language settings to Euskara (Basque) in the Firefox app.", "task: Change the language settings in the Firefox app to Belarusian (Беларуская).", "Task: Change the language setting of the Firefox app to Bosnian.", "Task: Change the language settings in the Firefox app to Breton (Brezhoneg).", null, "task: change the language settings to Basque in the Firefox app.", "Task: Change the language settings of the Firefox app to English (United States).", "Task: Change the language settings in the Firefox app to Bulgarian (Български).", "task: Change the language settings in the Firefox app to Burmese (မြန်မာ).", "Task: Change the language settings in the Firefox app to Catalan (Català).", "Task: Change the language settings in the Firefox app to Binisaya/Cebuano.", "Task: Change the language settings in the Firefox app to Central Atlas Tamazight.", "Task: Change the language settings in the Firefox app to Central Kurdish.", "task: change the language settings of the Firefox app to Chinese (Simplified Han).", "task: Change the language settings in the Firefox app to Traditional Chinese (繁體中文).", "Task: Change the language settings of the Firefox app to Kernewek (Cornish).", "task: Change the language settings in the Firefox app to Corsican.", "Task: Change the language settings of the Firefox app to Croatian (Hrvatski).", "Task: Change the language of the Firefox app to Czech (Čeština).", "task: Change the language setting of the Firefox app to Danish.", "Task: Change the language setting in the Firefox app to Dutch (Nederlands).", "Task: Change the language settings to English (Canada) in the Firefox app.", "Task: Change the language settings to English (United Kingdom) in the Firefox app.", "Task: Change the language settings to Esperanto in the Firefox app.", "Task: Change the language settings in the Firefox app to Estonian (Eesti).", "task: Change the language settings in the Firefox app to Suomi (Finnish).", "Task: Change the language settings in the Firefox app to French.", "task: change the language settings in the Firefox app to Furlan (Friulian).", "Task: Change the language settings of the Firefox app to Pulaar/Fulah.", "task: change the language settings to Galego (Galician) in the Firefox app.", "Task: Change the language settings in the Firefox app to Georgian.", "task: Change the language settings in the Firefox app to Deutsch (German).", "task: change language setting from English to Greek in the Firefox app.", "task: Change the language settings in the Firefox app to \"Guarani\".", "Task: Change the language settings in the Firefox app to Gujarati (India).", "task: Change the language settings to Hebrew in the Firefox app.", "task: Change the language settings in the Firefox app to Hiligaynon language.", "task: Change the language settings in the Firefox app to Hindi (India).", "task: Change the language settings in the Firefox app to Gujarati (India).", "task: Change the language settings in the Firefox app to Hungarian (Magyar).", "task: change the language settings in the Firefox app to Icelandic.", "task: Change the language settings in the Firefox app to Indonesian (Bahasa Indonesia).", "Task: Change the language settings in the Firefox app to Interlingua.", "Task: Change the language settings in the Firefox app to Irish (Ireland).", "task: Change the language settings in the Firefox app to Italiano (Italian).", "task: change the language settings of the Firefox app to Japanese.", "task: Change the language settings in the Firefox app to Taqbaylit Kabyle.", "Task: Change the language settings in the Firefox app to Kannada (ಕನ್ನಡ).", "Task: Change the language settings in the Firefox app to Kara-Kalpak language.", "Task: Change the language settings in the Firefox app to \"Қазақ тілі\" (Kazakh language).", "task: change the language setting in the Firefox app to Kazakh.", "task: Change the language settings of the Firefox app to Korean.", "Task: Change the language settings of the Firefox app to Lao.", "Task: Change the language settings to Ligurian in the Firefox app.", "task: Change the language settings in the Firefox app to Lietuvių (Lithuanian).", "task: Change the language setting in the Firefox app to Dolnoserbšćina (Lower Sorbian).", "task: change the language setting in the Firefox app to Malayalam.", "task: Change the language settings in the Firefox app to Marathi.", "task: change the language settings in the Firefox app to Nepali (Nepal).", "task: Change the language settings in the Firefox app to Norwegian Bokmål (Norway).", "Task: Change the language settings to Norwegian Nynorsk (Norway) in the Firefox app.", "task: change the language settings in the Firefox app to Marathi.", "task: Change the language settings in the Firefox app to Occitan.", "Task: Change the language setting of the Firefox app to Odia.", "Task: Change the language settings to Persian in the Firefox app.", "Task: Change the language settings of the Firefox app to Polish.", "Task: Change the language settings of the Firefox app to Portuguese (Brazil).", "task: Change the language settings in the Firefox app to Portuguese (Portugal).", "Task: Change the language setting in the Firefox app to Punjabi (India)", "Task: Change the language setting in the Firefox app to Punjabi (Pakistan).", "task: Change the language settings in the Firefox app to Romanian (Română).", "Task: Change the language settings in the Firefox app to Rumantsch Romansh.", "Task: Change the language settings to Russian in the Firefox app.", "task: change the language settings of the Firefox app to Russian."], "d3f7619910030a1d9c5401fda56c10f780691a537fd34cc6aed5c6a238d34073": [null, null, null, null, "task: Enable HTTPS-only mode and configure its settings for enhanced website security.", "Task: Enable HTTPS-only mode and configure its settings for enhanced website security in Firefox.", null], "e8e207edb99e1ee3f917a357e34c26729f529b7f89b9ab87b27a7a35fbc71bdf": [null, "task: change the default browser app to Chrome.", "task: Set Firefox as the default browser app on the smartphone.", "task: Set Firefox as the default browser app on the device", "task: change Firefox to be the default browser on the device.", "task: Set Firefox as the default browser app on the smartphone.", null], "51c62413af049e1da6c2785664d56b8cf8dcc04fb394ff198c9b9641b6196b8b": [null, null, "task: Set Firefox as the default browser app.", null, null, null, null], "5d892ccb2dc3a399035baec1546bb331ae9d36000df429cc13b7cf8205f51417": [null, null, "task: Set Firefox as the default browser for the smartphone.", "Task: Set Firefox as the default browser on the smartphone.", "task: Set Firefox as the default browser and manage the Caller ID & spam app settings.", "task: set Google as the default digital assistant app in the Firefox browser.", "task: Set Firefox as the default browser in the Home app Pixel Launcher.", "task: set Firefox as the default browser for the smartphone.", "task: Set SMS Messenger as the default SMS app in Firefox browser.", "task: Set Firefox as the default browser for opening links on the smartphone.", null]}, "camera": {"863cb466e6a7b76e3579075348e7500c30d85b1deecbd22fd9bad4fcb02cdbfb": ["Task: Set a timer for capturing photos or videos", "task: adjust camera resolution", "Task: Adjust camera settings and toggle timer and camera mode.", "Task: Capture a video using the smartphone's camera, adjust camera settings, toggle timer and camera mode.", null, null, "Task: Switch the camera from front to back or vice versa.", "task: Take a photo or record a video using the camera app.", "Task: View the last captured photo or video.", null], "be4494fd25abe78afe86c224e86b0aba60534f39525371c837a1d3bedff9919f": ["Task: View information about the camera app, such as version, developer, or general details.", "task: customize camera settings and capture mode customization", null, "Task: Customize the colors of the camera interface.", null, "task: customize camera settings and purchase the \"Simple Thank You\" option", null, "task: disable the shutter sound on the camera.", "task: customize camera settings to use volume buttons as shutter.", null, "Task: Customize camera settings to disable saving photo exif metadata.", "task: customize camera settings to disable the option of flipping front camera photos horizontally.", "task: change the settings to save photos and videos to a specific DCIM folder instead of the default location.", "task: Adjust the photo compression quality to 80%.", null, "task: Customize camera settings for capturing photos/videos with minimized latency."], "fc63633d276f5f311e9a772a8b4c25b0d386064b8b7d22520af1e43de47529b2": ["task: adjust the photo compression quality of the camera to 100%.", "Task: Change the photo compression quality to 95% in the camera settings.", "Task: Adjust the photo compression quality of the camera to 90%.", "Task: Adjust photo compression quality to 85% and check the current setting.", "task: Adjust photo compression quality in camera settings.", "task: Adjust the photo compression quality of the camera to 75%.", "task: adjust the photo compression quality to 70% in camera settings.", "task: adjust the photo compression quality to 65%", "Task: Change the photo compression quality of the camera to 60%.", "Task: Adjust the photo compression quality to 55% in the camera settings.", "Task: Adjust the photo compression quality of the camera to 50%.", null], "f641a251595eb30fb76401f9d58e16b21a840b184c390915d35769c7b638e125": ["task: Adjust camera settings to minimize latency and maximize quality.", "task: Adjust camera settings to minimize latency, maximize quality, and navigate back.", null], "6b487e7860b4bcc2b78505508b20891f3434e16e473a55e614b91c875249e809": [null, "task: toggle between front and back camera modes", null, null, null, null, null, null, null, null, null], "de630b21122c64a3fe10ecfaed57c4f75aa0ccc034c0d4f0829a1eceee1cd316": [null, null, null, null, "task: capture a video or photo using the smartphone camera", null, null, null, null], "f0c7d4f5cd80d174486b8bf80b9d8fdf9194087dba2597e5a56418705f1d28e1": [null, "Task: Rotate the last captured photo in the camera app.", "Task: View and edit the properties of the last captured media (photo or video) from the camera.", "task: view properties, rotate, favorite, edit, share, or delete a recently captured media.", "Task: View the properties of the last captured media and toggle it as a favorite.", "Task: View and edit the last captured photo or media on the smartphone.", "Task: Share the most recently captured media.", "Task: Delete the last captured media/photo.", null], "b85c0edc1b54705cf5f91dce3d464afe475ee6043af156be966ffc0fabc49582": ["task: rotate the last captured media to the right and return to the previous screen", "task: rotate the last captured media to the left.", "Task: Rotate the recently captured media image by 180º and return to the previous screen.", null], "1c3d85795f30f7072b53f1c0021459dc742227f450e3f438ef74fc857a7015fe": [null, "Task: Rotate the last captured media to the right and save it.", null, null, null, null, null, null, null], "34c71e0a523c1ff4c2a477ffecb8038723d8c79322d8aa899f938f42a0ade947": [null, null, null, null, "Task: Save the last captured media with a specified name, location, and format.", "task: Save the last captured media file, rotate it to the right, and save it with a specified name, location, and format.", null], "32dbaff474d342fd8ca77a020b07dd99a3fc04fbb616bbc641d0d4524504d0a7": [null, "task: resize the last captured media file and confirm overwriting the existing file or go back in the camera app.", "task: resize and overwrite the last captured media file", null], "cc08f33bcb26b46c31defd9712cc902dc9c63c7ea5f6bf78c682b5f56631646c": [null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, null, "task: view and edit the properties (including GPS coordinates) of the last captured photo.", "task: remove EXIF data from the last captured media", "Task: View and edit properties of the last photo captured with the smartphone's camera.", null], "90b09a315edf7d063855fd669828d16be6f1d47b81efdcf37319cc93dff0da22": ["Task: Rename the last captured media.", "task: hide the last captured media.", "Task: Copy the last captured media to another location or device.", "task: Move the last captured media to a different location or folder.", "Task: Create a shortcut for managing and performing actions on the last captured media in the camera app.", "Task: Open the last captured media with another app.", "Task: Set the last captured media as something (e.g., wallpaper, lock screen background, profile picture).", "task: rotate the orientation of the last captured media", "task: print the last captured media from the camera.", "task: resize the last captured media", "task: view the location where the last captured media was taken.", "Task: Create a slideshow using the last captured media and perform actions such as renaming, hiding, copying, and more.", "task: manage and organize the recently captured media by accessing the settings and performing various actions like renaming, hiding, and copying.", null], "6c8e1a983c6456180e0e8c4c514aa3236dfe185cacca71a4c1c348ba9d9bab82": [null, null, null, "Task: Rename the last captured media file", "task: Rename the last captured media file.", null], "ae571e20fdff6720466325a2e400ba95cfa8709d8a6d312291e51667a17b4213": [null, "task: Save the last captured media to the DCIM folder number 6.", "Task: Save a photo or video to a specific destination folder.", "Task: The user wants to copy the last captured media to a different destination folder.", "task: Save the last captured photo/video to a different folder.", null], "36b957c9a6eae7a6c86933c9f6b9b384c0b5247c5767a8afe535816879658cb5": [null, "task: move/copy the last captured media file to a different folder in the smartphone's internal storage.", "task: Move the last captured media file to a specific folder in the DCIM directory.", "task: Copy the file \"pic1.jpg\" from the camera's last captured media to a specific folder in the smartphone's internal storage.", "Task: Copy the image \"pic2.jpg\" from the internal storage to another folder.", "task: copy the last captured media file \"pic3.jpg\" to a specific folder in the smartphone's internal storage.", "task: Copy video1.mp4 to another folder in the smartphone's internal storage.", "task: Copy the video file \"video2.mp4\" from the camera's internal storage to another folder.", "task: Copy the video file \"video3.mp4\" to a specific folder in the smartphone's internal storage.", null, null, null], "6919cfa097bb6dc5bcc70b3a04c75500aeb04e8db499b49ba0c033318894e3aa": [null, "task: Move the last captured media from the camera app to an external folder on the smartphone.", "task: Select storage location for camera app and copy media to internal storage folder.", null], "f4e3bb56b18f61edcbc485302f7614a0c5ba2e590c7ce1e15e06c3272314ca1e": [null, "task: move or copy the last captured media file to a specific folder in the smartphone's internal storage or SD card.", "task: Move or copy a media file from the camera to a specific folder in the internal storage, possibly with the option to select the SD card as well.", "task: Move a media file from the camera app to an internal folder in the smartphone's file system.", "task: Move the last captured media file from the internal storage to another folder.", "task: move or copy media files from the camera to a specific folder within the internal storage of the smartphone.", "task: view and copy photos from the camera to a specific folder in the internal storage or SD card.", "task: Download media from the camera to the internal storage folder on the smartphone.", "task: move the last captured media to the LOST.DIR folder in the Internal storage.", "task: Move a media file from the camera to the internal storage or SD card in the Movies folder.", "task: Transfer or copy media files from the camera to an internal folder or SD card for storage or organization.", "task: Move the last captured media from the camera's internal storage to the \"Other folder\" within the smartphone's file system.", null, null, null, "task: Move recently captured media from the camera to the internal storage's Pictures folder.", "task: move the last captured media to the Internal folder in the smartphone's file system for handling images.", "task: Move a media file from the camera folder to the internal storage's Ringtones folder.", null], "2ce0ce5ef5b07019e9729194e7323bdc87877c36b8a4cd55f2427edd27789449": [null, null, null, "task: Add camera app shortcut to home screen.", "task: Add the camera app to the home screen and select photos for automatic addition.", null], "3b13d8a611db53137d69c3ee8372b669241dbde6b3bf434a38222a30cfcf561e": [null, "task: change the camera orientation to portrait and go back to the previous screen.", "task: Change camera orientation to landscape and return to the previous screen.", "Task: Adjust the camera orientation settings and return to the previous screen.", null], "d8dc4abb0e56e5f4a2054cebed843fab68f8accaf9b3302aefe20c7e5204846d": ["task: print the last captured media from the camera.", "task: Print the last captured media and save it as a PDF.", "task: print the last captured media with 1 copy and Letter paper size.", "task: Print the last captured media from the camera.", "task: print the last captured media and save it as a PDF.", null], "7dbda301e5283dc4e2bd19349c209d758878021484254956b28096bf83dfa517": [null, null, "task: Save the last captured media as a PDF and view it in list format.", "task: Save the last captured media as a PDF file and print it.", null, "task: Save the last captured media to a new folder and then print it or save it as a PDF.", null, null, null, null, null, "task: save the last captured media to a PDF file and then print it.", null], "05439376b08f3a4ec00debd52cc232b6c91e797fb80d5bf7d6a66a19f97a3e2c": [null, null, null, null, null, null, "task: resize the last captured media", "Task: Resize the last captured media and save it to a specified location.", null], "33122048a244f8c47e311dd09b072b0e93656461a2388359aa9c570f3966d7e5": [null, null, "task: customize camera settings for creating an animated slideshow with the last captured media.", "task: View a slideshow of last captured media without including videos.", "task: view a slideshow of the last captured media, including GIFs, with additional options.", "task: Create a randomized slideshow with the last captured media in the camera app.", "task: start a slideshow with the last captured media, checking the option to move backwards.", "Task: Configure slideshow options and set the loop option to \"False\" for the last captured media on the camera.", "task: start a slideshow with the last captured media.", "task: view the last captured media in a slideshow format.", null], "56d9874580c990f0b25ed9f97f016ca4c96074345486857b324b273934397964": [null, "task: View and edit the last captured media in the basic editor in the gallery app.", "task: View and edit the last captured media photo using various tools such as gallery, basic editor, photos, draw, and markup.", "task: The user wants to edit a photo by drawing on it using the draw tool.", "Task: Markup the last captured media using various editing tools.", "task: Edit the last captured media by using various tools such as gallery, basic editor, photos, draw, and markup.", "task: Edit the last captured media using various tools such as gallery, basic editor, photos, draw, and markup.", null], "9204fffe58de3098a45867317f113f5217e9e0dc90b978efb2bc2b8b78ece344": [null, "task: Delete the last captured photo and enable an option to prevent future deletion prompts.", "task: delete the last captured photo and set the option to prevent future prompts for deletion.", "task: delete the last captured media/photo and confirm the deletion to prevent future prompts.", null]}}